[
    {
        "source": {
            "id": null,
            "name": "Eurogamer.net"
        },
        "author": "Victoria Phillips Kennedy",
        "title": "Surprise! Animal Crossing: New Horizons' free 3.0 update for Switch releases early - Eurogamer",
        "description": "Good news, Animal Crossing: New Horizons' free 3.0 Switch update for all owners has been released earlier than we thought.",
        "url": "https://www.eurogamer.net/surprise-animal-crossing-new-horizons-free-30-update-for-switch-releases-early",
        "urlToImage": "https://assetsio.gnwcdn.com/20260114131107-01KEYA1B9XZR6PV8N5RYBKFEK1.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
        "publishedAt": "2026-01-14T13:24:14Z",
        "content": "By hook or by Nook.\nGood news, Animal Crossing: New Horizons' free 3.0 Switch update for all owners has been released earlier than we thought.\nAnimal Crossing: New Horizons' highly anticipated 3.0 update was expected to be released for those here in the UK at 1am tomorrow, 15th January. However, many of us very excited folks at Eurogamer have discovered that the update is actually available to download now. Yes, you read that correctly. It is available now.\nAs I type, our wonderful Guides team is downloading the 3.0 update. I, alas, will have to wait for my lunch break, which thankfully isn't too far away. Anyway, I digress. Back to that update!\nAnimal Crossing: New Horizons 3.0 sees - among other things - the grand opening of a new Resort Hotel down on the pier, which is run by Kapp'n's family, as well as a new Reset Service, courtesy of Resetti, that'll offer a quick way to get a fresh start.\nSomething our Kelsey is quite excited about is the introduction of bulk crafting. In fact, there are a few things she is excited about, and Kelsey has created a handy guide detailing the five things you need to check-out first in Animal Crossing: New Horizons' 3.0 update.\nHowever, while this free update for all Animal Crossing: New Horizons' users is live now, the Switch 2 paid for upgrade is still unavailable. This chap will go live tomorrow, 15th January, so keep an eye out for that.\nFor everything coming with the Switch 2 edition of Animal Crossing: New Horizons, be sure to check out our aptly named guide: Everything new in the Animal Crossing New Horizons 3.0 update and Switch 2 edition.\n\nAnimal Crossing: New Horizons\n\n\nNintendo Switch\n\n\n\nHow to get and use Resetti's Reset Service in Animal Crossing New Horizons                    \n\n\n\nAnimal Crossing patch notes: What's new in update 3.0 in New Horizons                    \n\n\n\nAnimal Crossing New Horizons Zelda item list                    \n\n\n\nHow to get Mineru and Tulin in Animal Crossing New Horizons                    \n\n\n\nAnimal Crossing New Horizons LEGO Items list                    \n\n\n\nAnimal Crossing New Horizons Resort Hotel explained                    \n\n\n\nHow to get the Animal Crossing New Horizons update                    \n\n\n\nHow to unlock Resort Hotel in Animal Crossing New Horizons                    \n\n© 2026 Eurogamer.net  a brand of IGN Entertainment, Inc. All rights reserved. 18 Mansell Street Level 3, London, E1 8AA, United Kingdom. No part of this website or its content may be reproduced without the copyright owner's permission. Eurogamer is a registered trademark of Gamer Network Limited."
    },
    {
        "source": {
            "id": null,
            "name": "Push Square"
        },
        "author": null,
        "title": "PS1 Ridge Racer Poised for PS5, PS4 via PS Plus Premium - Push Square",
        "description": null,
        "url": "https://www.pushsquare.com/news/2026/01/ps1-ridge-racer-poised-for-ps5-ps4-via-ps-plus-premium",
        "urlToImage": null,
        "publishedAt": "2026-01-14T13:23:26Z",
        "content": "Guest\nGuest\nLogin | Sign Up\nPush Square\n\nGuest\nLogin or Sign Up\nIt takes a Village\nFollowing the recent partial leak, Sony has officially announced the full lineup of January 2026's PS Plus Extra and PS Plus Premium games.\nSet to arrive on 20th January, we have a number of PS5 and PS4 titles heading into Extra's game catalogue, as well as a sole new addition to Premium's classics range.\nHere's the full rundown of what's heading our way this month:\nSubscribe to Push Square on YouTube167k\n\nAll PS5, PS4 games lists for PS Plus Essential, Extra, and Premium\nWhat are your thoughts on January 2026's PS Plus Extra and Premium games? Let us know in the comments section below.\n[source blog.playstation.com]\nAbout Stephen Tailby\n\nStephen has been part of the Push Square team for over six years, bringing boundless enthusiasm and a deep knowledge of video games to his role as Assistant Editor. Having grown up playing every PlayStation console to date, he's developed an eclectic taste, with particular passion for indie games, arcade racers, and puzzlers. He's also our go-to guy for Sonic-related matters, much to his delight/chagrin.\nComments 44\n\nGlad I got rid of premium, nothing for me overall this month.\n\nFor as amazing as it is, PS1 Ridge Racer as the only PS Plus Premium game is really disappointing considering the context.\n\nPremium is a joke. I thought Nintendo's pace was glacial but this is absurd.\n\nAnd this why Extra is the way to go.\n\nIt’s Riiiiiiiiiiiidge Racer!!\nRemember that one!\n\n@Oram77 the value I've had from extra is crazy, I do already own the headliners cos I love Yakuza and Resident Evil but theres always a couple of games im interested at least every month.\n@ATaco two cheeks of the same fat bum. Nintendo had a better year last year because Switch 2/Gamecube etc. but ive not touched the service in years now cos I played the classics and moved on. I expect they won't release much this year\n\n@get2sammyb Isnt the context here that Premium is only $2 or $3 more than Extra? And you get 4K streaming on console, streaming to pc and handheld, a library of ps1, ps2, psp, ps3 games and at least one retro game each month? (Last year, many months saw 2 retro games added to premium, some months even 4)\nConsidering $2 or $3 likely isnt even enough to cover the cost of the streaming servers etc, personally i think it’s a pretty good offering for that small increase of money.\nUnless you were talking about the context of there being an arcade version of this game in stead of the fact that they added only one game this month to premium…\n\n@LogicStrikesAgain Premium is amazing value and I am tired of people claiming that it is not.\n\nThe leaks already made it a very good month, getting darkest dungeon 2 on top of those make it a brilliant month.\nRE village, infinite wealth, Expeditions a mudrunner game and darkest dungeon 2 are all instant downloads for me and a couple of the others look like decent enough smaller games I might play between the bigger titles. Great month.\n\nThe premium offerings are a joke, if it wasn't for the Portal streaming then I would lower my sub down to Extra, which again seems like great value.\n\nPs plus extra and premium is complete rubbish every month ill buy my games these offerings are a joke I do think essential is amazing value for money though the 3 games a month\n\nPremium is excellent. For £2 there's an extensive library, streaming support ( I use this to test games before committing to the download), and all the Demos. Having access to the Demos has seen me buy games I would not have gotten a chance to try and I value that highly. It's less than a coffee per month. This continued rhetoric that its poor value is really silly.\n\n@LifeGirl Honestly, i agree. People are entitled to their opinion, but hearing people sometimes trash this service seems so unreasonable. Paid yearly this service costs just $13/month!\n@UltimateOtaku91 This is exactly what i mean. Premiums offering isnt a joke. For $2 or $3 more you get a classics library of around 400-500 titles, a rotating library of around 100 movies, a small VR library, 4K streaming, streaming to pc and the portal and at least one retro game per month.\nFor the people thinking their offering is a joke, what do you say they could realistically add more for that small price increase?\nFor everyone’s fyi, Sony never said they’d be adding 10 retro games a month or something. For that small price increase from extra i think its unreasonable to expect more that 1-2 titles a month (on top of everything else premium offers)\n\nThe Resident Evil series has become my gaming guilty conscience. I've still not played VII and I need to get caught up\nArt of Rally is also one I've had my eye on\n\n@LogicStrikesAgain Its base offerings aren't a joke, but it's new monthly additions (usely just 1) are. I'm happy to pay the price for the streaming service provided, my comment was about the monthly additions.\n\nExcellent month for Extra - I own RE: Village, but will definitely dive into a Quiet Place and Darkest Dungeon 2.\nI’m sure the first will scare me silly and the latter will infuriate me to the point of tears, but it’s always good to feel something\n\n@UltimateOtaku91 My bad bro. If you mean that the added monthly retro titles aren’t to your liking, then that’s totally fair\n\nAs it happens, I was thinking the other day I should replay RE Village while waiting for Requiem's next month launch - so (finally!!) this month's offer is right on the spot!\nWhere's that \"Are you happy with this month's... \" POLL ? I wanna vote!\n\nExpeditions is on Switch and Village is bound for NS2, but I'm still lowkey tempted to dip toes in both (especially since my respective franchise binges are a fair bit behind regardless), but only if I can get the streaming to work well again - my PS4 storage is pretty strained after downloading Wolfenstein New Order (which I just did due to the very streaming issues in the first place - and more generally due to the game's sideload refusing to launch on Deck, of course).\n\nI was happy enough with Art of Rally and potentially Ridge Racer when they were leaked. Now it's been confirmed I would also play Darkest Dungeon 2 and A Little to the Left if I can find the time.So I'd call this month a win for me!\n\nSolid month on Essentials and Extra.\n\nGiven I have Resi village vr and infinite wealth already (phenomenal games) I’m glad to see Darkest Dungeon 2. I love roguelites, so will definitely give it a go.\nBy the way. Premium is great if you have a portal. For the extra £1 odd a month more than extra, it’s pretty much a no brainer regardless of what you think about the premium games (I honestly don’t think I’ve played one, although I would have with Type4 if it had trophies)\n\nAh looking forward to playing darkest dungeon two on PS5. I bought it in early access on epic game store which you know now that it’s in full release means that it’s an EGS purgatory so yeah that’ll be nice.\n\nI haven't played anything other than Village and Ridge Racer (but on PS1 forever ago) so although they're not titles I was that fussed about, I'll take it as a win to give all these games a chance.\nI played Yakuza: Like a Dragon at the worse point of my entire life along with Cyberpunk 2077, and I can't play either without being taken back to that time, so it put me off playing Infinite Money with it's association, but I'll see what happens when I fire it up..\n\nJust to get ahead of things, remember that Ridge Racer is BaNamco and they never add trophies to their classic games for some reason.\n\nI don't know how many more times it needs to be explained to \"the disappointed ones\" that Premium is not mainly or at least not only defined by the games that are added to that tier ... It is getting tiresome to read the same pretentious nonsense every month.\n\nExtra is pretty much premium these days 😂 great selection of games though I'm happy\n\nah yes I do love the one (singular) classic title being the overall inferior version of a game you can already play with trophy support on PS5 through Arcade Archives, really pushing the Premium side of PS Plus Sony 🙃\nThe Extra lineup is admittedly very solid though, RE Village and LaD Infinite Wealth are very strong additions to start off the year 👍\n\nHow will i get on with Infinite Wealth if I struggled with The Man Who Erased His Name guys?\n\nYou can get a ps1 emulator running on a potato these days, why anyone would sub to premium for a massively watered down selection of these titles is beyond me\n\n@old_gamer74 I haven't played Yakuza/LaD yet so I can't speak from experience but Gaiden and Infinite Wealth play extremely differently from each other (one is a beatemup and the other a turn-based JRPG) so I think it moreso comes down to whether you vibe with turn-based games or not XD\n\nDecent list for me but overall a low value. Most of those games are worth $20 or less if you bought them on sale.\n\nI could think of a world where the small price of PS Plus Premium gave you just 1 of the 6-7 benefits it adds. I understand the context: People are only expressing disdain for the addition to the growing library and maybe they don't stream, play games from the library, watch movies from their selection or make use of the trials.\nBut if you do some or all of the above, you are getting a good deal. For me, it also prevents me from using money. That's probably \"girl math\" 😁\n\nGlad A Quiet VR is free so I can try it out. Really want Darkest Dungeon free on PC because it's better on a handheld that doesnt require remote play but I'll take it.\nRE Village and Infinite Wealth are 10/10 games but I already own them. Great for people who want to try something new.\n\n@Blaze215 Maybe because there are so many other reasons why one would wanna sub to premium. The reason i sub sometimes is for streaming, it’s very convenient for me and works very good. That way my kid and i can try out the whole library without having to wait so long for games to download, it’s perfect for me, and only a few € more than Extra.\nPersonally, i dont understand why some people are preoccupied so much with why others want to sub premium. I really dont care why anyone subs to whatever (film/gaming) service they wanna sub to, i just assume it gives them value. But somehow people almost seem offended about others using PS Plus Premium (not talking about you here, but just in general)\n\n@Fizza cheers mate. 100% will give it a crack and see how we go!\n\n@LogicStrikesAgain Plus, if you subscribe to the year plan during Black Friday sale, you ending persons way less. I did this, and extra was just 5 dollars less for the entire year.\n\nA lot of 8's or infinities.\n\n@LogicStrikesAgain I completely get that. May be a bit of miscommunication here. What i mean is why would anyone sub for the classic games in the tier. If there are other reasons you do then fair enough\n\nI feel like most that complain about Premium do so to justify their own reasons for not being able to afford what equates to a couple bucks a month extra at most or rather their parents won’t cover it. There is clearly value there and at an incredibly low price at that.\nPremium is great.\n\nRidge Racer Revolution maybe. Why is premium so bad. I accidentally paid for it so kept it and the PS1 emulation is worse than any other I use, and unless you want to stream on a portal anywhere or watch movies that you can get anywhere else on other subscriptions, someone is going to remind me I can get 5% off but the price of the sub covers that. I do miss being able to play PS3 games, but not that much, because I have a PS3 upstairs and never use it...\nPremium is pants, I pay my way have 3 kids and a grandkid.\n\nFor those that complain about the value of Premium, perhaps it just isn't for you. I see Premium as a membership for hardcore gamers. You want to play retro games, you want to stream to PC, stream to your handheld etc, these are not needs of an average gamer..\nPersonally I have Extra, as I have no interest in playing hundreds old games that I've already played as a child and too clunky by modern standards, nor do I stream on PC, or while away from my house, which i personally find too extreme given the many other priorities in life.\nIn a nutshell, if you dont find value in Premium, just downgrade. Simple solution.\n\n@GreenyD\nI really miss Kaz Hirai, hope he's doing well wherever he is.\n\nI look forward to eventually playing both Like a Dragon: Infinite Wealth and Resident Evil Village.\nI may also check out both A Quiet Place: The Road Ahead and The Exit 8, only time will tell.\n Show Comments\nLeave A Comment\nHold on there, you need to login to post a comment...\n\nPS Plus Extra, Premium Games for January 2026 Leaked\nUpdate: Seventh game leaked\n\n45+ PS5, PS4 Games to Buy in PS Store's Refreshed January Sale\nCheck out these discounted games\n\nCode Violet (PS5) - Gooner Shooter Can't Get It Up\nCode Blue\n\nTry the Spiritual Successor to Parasite Eve, Coming to PS5 in 2026\nBut demo is only on Steam for now\n\n9 PS Plus Extra, Premium Games for January 2026 Announced\nIt takes a Village\n 6\nNews Prince of Persia: The Sands of Time Remake's Big Website Leak Appears to Be Fake\n 6\nNews Final Fantasy 7 Remake on PS5 Gets Bonus Switch 2, Xbox Features Next Week\n 10\nNews Ecco the Dolphin Will Swim Again in Several Upcoming Games\n 6\nNews Artist Ilya Kushinov Teams Up with Atlus Alumni on Upcoming School RPG\n 8\nNews Arcade Beat-'Em-Up SlashOut Joins Emergency Call Ambulance in Yakuza Kiwami 3 on PS5, PS4\nFeature 50+ PS5, PS4 Games to Buy in PS Store's Refreshed January Sale (North Am...\nReview Code Violet (PS5) - Gooner Shooter Can't Get It Up\nNews Try the Spiritual Successor to Parasite Eve, Coming to PS5 in 2026\nNews Maybe There Is Still Hope for the Final Fantasy 13 Trilogy on PS5, After...\nNews 9 PS Plus Extra, Premium Games for January 2026 Announced\nGuide Best Single Player Games on PS Plus\nNews Fable Has Been 'Targeting' PS5 for a While, Potentially Day and Date\nNews 'PS5 Pro Gets the Short End of the Stick Again': Fans Gutted New HYPERPO...\nNews Xbox Exclusive RPG Avowed Is Coming to PS5 in February with Major New Fe...\nNews Sony Needs to Move Mountains to Get Samson: A Tyndalston Story on PS5\nPopular Right Now\nShow More \nJoin 474,013 people following Push Square:\n© 2026 Hookshot Media, partner of IGN Entertainment | Hosted by 44 Bytes |  AdChoices | Do Not Sell My Personal Information"
    },
    {
        "source": {
            "id": null,
            "name": "Nintendo Life"
        },
        "author": "Ollie Reynolds",
        "title": "An Overlooked Disney Collection From Digital Eclipse Has Been Rated For Switch - Nintendo Life",
        "description": "And Switch 2!",
        "url": "https://www.nintendolife.com/news/2026/01/an-overlooked-disney-collection-from-digital-eclipse-has-been-rated-for-switch",
        "urlToImage": "https://images.nintendolife.com/394940b8ce5dd/large.jpg",
        "publishedAt": "2026-01-14T13:15:00Z",
        "content": "Guest\nGuest\nLogin | Sign Up\nNintendo Life\n\nGuest\nLogin or Sign Up\nAnd Switch 2!\nDigital Eclipse has done some pretty stellar compilations over the years, but one of its most overlooked efforts came in 2017 with The Disney Afternoon Collection.\nOriginally available on PC, PS4, and Xbox One, the compilation has now been rated by the ESRB for the Switch and Switch 2, though when we can expect to see it launch is anybody's guess. The rating itself is attached to Atari which, as you'll no doubt be aware at this point, wholly owns Digital Eclipse as a subsidiary.\nThe Disney Afternoon Collection contains a total of six titles from the NES (so why it's taken this long to come to Switch is beyond us), including:\nOur pals over at Push Square gave the compilation a score of 8/10 back in 2017, stating that \"the production values and accuracy of these emulations are second-to-none\" while noting that rewind features and art galleries make it an essential purchase.\n\nPush SquareThe collection that flaps in the night\nWould you be happy to finally see The Disney Afternoon Collection on Switch and Switch 2? Let us know your thoughts with a comment in the usual place.\n[source esrb.org]\nAbout Ollie Reynolds\n\nNintendo Life’s resident horror fanatic, when he’s not knee-deep in Resident Evil and Silent Hill lore, Ollie likes to dive into a good horror book while nursing a lovely cup of tea. He also enjoys long walks and listens to everything from TOOL to Chuck Berry.\nComments 117\n\nOh wonderful! And about time! Maybe we'll get a Disney's Magical Quest trilogy at some point??\nDuckTales Remastered would also have been nice but very happy with the original coming to switch (finally)\n\nLimited Run announcement in 3…2…1…\n\nWow, this one was released around the same time the switch 1 was released. I always wondered why it wasn't released on the switch. And now after almost 10 years it is finally coming home.\n\nNice! Was just thinking about NES Ducktales specifically the other day and how it's weird it still isn't available on Switch. I've never actually played it but have always heard great things and as a platforming aficionado, its impact can't be overstated. Shovel Knight and Cranky Kong probably wouldn't have their pogo bounce moves if not for this game.I would much prefer the HD remake but this is still really cool. Can't wait to experience it for myself for the first time.\nThe moon theme is overrated, though. I said what I said.\n\nSo glad it's finally happening (and I bet @DwaynesGames even more so) - absolutely looking forward to it whenever it comes out!\n\nFinally! Why did it take 9 years?\n\nWow! Peeps have been clamoring for a Switch port of this for years. I’d gladly pick up a physical release. 🦆\n\nVery nice collection of games that are actually good.\n\n@JohnnyMind Indeed! 🥳🎉🥂\n\nUgh, I remember being bummed about this snubbing the Switch back then. These games belong on a Nintendo system.\nSo glad to see this rectified now. Better late than never. I’d just rather play these on the 2 though, along with the other classic Disney games like Aladdin, Lion King, and Jungle Book.\n\nthis wasnt already on switch?\n\nThese were some peak Disney games! Might just get this collection!\n\nIf they had included QuackShot, I'd definitely get it. I loved that game as a child.\n\nI already have this on Xbox, but that's pretty neat\n\n@TheWokesterGamer For some odd reason no it was not and for nearly a decade too.\n\n@MarzoriuM I understand why it skipped the Wii U. However, it should have been released for the 3DS, and then later on Switch after the Switch proved to be successful.\n\nAmazing games! Especially Darkwing Duck! I have the original NES cartridge on route to me \n\nI also want Mickey Mania and Toy Story on modern gen consoles.\n\nI will definitely be there for the Switch release. Just keep a physical away from LRG.\nI just wish Disney were more open to let companies re-release their older games. My Switch would love some Magical Quest, Castle of Illusion and Mickey's Speedway USA.\nEDIT: Also, other than Disney, who has the rights for a re-release of Mickey Mania and an obscure Japan-only game for the Super Famicom called Donald Duck no Mahō no Bōshi? The latter was published by Epoch, but I don't know if after they stopped releasing videogames they kept the code/rights to their games.\n\nThis is wonderful, wonderful news. Now if we could only get Konami to release Castlevania: Symphony of the Night on Switch...my dreams would be complete.\n\nLooks cool,\nbut I want a collection of Mickey Mouse games from the 16 bit era.\n\n@the_beaver\n\"If they had included QuackShot, I'd definitely get it. I loved that game as a child.\"\nWell, that would perhaps complicate things as:\nThe \"The Disney Afternoon Collection\" contains 6 (8bit) NES games made by Capcom.\nQuackShot is a (16 bit) Sega Mega Drive/Sega Genesis game made by Sega.\nI do agree a rerelease of Quackshot would be most welcome though. By itself or in a collection.\n\nThis was one of the collections that skipped NS1 where I always wondered why. Just never felt right to play this on Xbox, so I didn't buy it there. If it really comes to NS and NS2, I'll buy it on the latter.\n\nI can't believe it took them so long to bring this over. I just thought this was never going to happen, if it in fact does\n\nWeird that atari is publishing the rerelease when capcom did the original release 9 years ago.\n\nOh this is awesome! I was a gifted a PS4 and this and symphony of the night are the only reasons I plugged it in. Would love to finally take this thing with me on the go.\n\n@IronMan30\nIt'll probably just be for the Switch, but have some neat improvements on the Switch 2.\nEDIT: It's coming out for the Switch 2, too.\n\nExcited to see this! I wonder if we'd be able to get the Switch's NES controllers to work with it.\n\nSomething I forgot to say in my initial comment is that I could very well see this collection getting officially announced in a February Nintendo Direct. Would be a cool stealth launch game with a physical edition coming later.\nThen the Nintendo Direct narrator says, \"And...\" as the screen fades to black.\nFade in on DuckTales Remastered.\n...maybe that's a long shot, but a man can dream.\n\n@Not_Soos I'm happy about this but also really want to see a Switch release of Remastered!\n\n@JohnnyMind @Not_Soos @MarzoriuM It will be this collection’s 9th anniversary in April. 😊\n\nOooooooooooooh!!!!!\n\n@Scapetti A Disney's Magical Quest trilogy collection would be amazing. I'm sort of surprised. I'm sort surprised that DuckTales Remastered didn't come over early in the Switch's life since it was on the WiiU. Maybe there will be a Re-Remaster\n\nOooh. Chip and Dale was a favourite of my brother and I on the NES. Still have the cart!\n\nBetter late than never…?\n\nIndeed, most odd this has been absent from NINTENDO platforms for so long. I guess when it came out/was being developed was the WII U era, so maybe not much incentive for them to bother...but that they didn't do it for the Switch is odd.\n\nFreakin’ FINALLY!\n\nEh... I'm not sure I trust DE with these games. DE is notorious for adding significant input lag, and that would make most of these games borderline unplayable.\n\n@DwaynesGames Interesting, that would be a pretty good moment to release it or at the very least officially announce it - we'll just have to wait and see but anyway, thanks for telling us!\n\nPhysical release on Switch possibility?\n\nI look forward to playing this once LRG's physical copy is announced/shipped in a couple of years.\nGoodnight, everybody!\n\nwhy did it take almost 9 years for a collection of games that were originally made for a Nintendo console to release on Switch?\n\nNot sure that this is overlooked, I've seen people posting on here for ages asking for it. Although maybe the posts did start drying up around 2022.\n\nFor a moment i tought we were getting a switch port of Ducktales Remastered,would love so much to have it on Switch,alongside a Ducktales 2 remastered.Alan Young passed away,but the new Scrooge voice actor is very good (not David Tennant,he was a guest star just for the reboot,the actual new Scrooge voice actor can be heard in Kingdom Hearts 3)\n\nThe fact that this wasn’t already on Switch in 2017 is absolutely baffling, it makes no sense. I wish someone would ask the original publisher why they chose to ignore the console with the largest install base and the ideal demographic.\n\nThis would've popped off on Switch in 2017.\nIn 2025? Eh.\nI hope the people holding out for it on a Nintendo platform are happy.\n\nIll love to revisit Ducktales and Chip n dale... I played those hard on my NES days...\n\nGreat games and a nice collection. If my memory serves me right I think I have this on Steam. Might have to double check that. Regardless I’m still interested in getting this for Switch 2.\n\nFinally. This was an ideal match for the Switch and any Nintendo platformer fan from the NES days.\n\n\"...life is like a hurricane here in Duckburg\"\n\n@DwaynesGames indeed, unbelievable it is almost 10 years ago. Time flies!\n\nIt’s about time! 5 of the 6 games (sorry Tailspin) are flat out NES classics. I don’t think I’ll double… er quadruple… dip since I have these games on 3 platforms currently, but it’s still really cool to see. With rumors starting to mount, I’m starting to wonder if a January Nintendo Direct might be in the cards. It feels like stuff is leaking earlier in the year than typical.\n\nHas anyone played that Disney kart racer set in Walt Disney World? I played through it last year, if you're a fan of the Disney parks, it's cool as heck, if a bit janky. Racing through Big Thunder Mountain, man. Good stuff.\n\n@the_beaver Sega made a line of Disney games themselves.\n\nThis took obscenely too long. Still amazed that the DuckTales remaster (and while I'm thinking about it, the Monkey Island special editions) never made it to a Switch after alllll that time.\n\nBlathering blatherskites!!! This is awesome. Would love the DuckTales remaster, too, but I get keeping it limited to the originals.\nThey need to have someone make a Gummi Bears game to complete the Disney Afternoon theme. Better late than never, I say!\n@the_beaver\nQuackshot was awesome! I would love the chance to play that one again. And Gargoyles, too.\n\nI have all these games, including GameBoy DuckTales 1/2, but I will be very happy to have them playable on the Switch. The DuckTales games and Darkwing Dark especially so.I always thought it a shame Capcoms The Little Mermaid (NES) couldn't join them in the collection, it's not a Saturday Morning game, but it always felt apart of these blue box games\n\nOverlooked? No, we expected it back when it released and then heard squat about it until now.\n\n@canaryfarmer Glad I’m not the only one who would love to have the Monkey Island special editions! The Full Throttle remaster is missing as well!\n\nFINALLY! This not being on Switch was mind boggling\n\nIt should be an easy sales pitch, but it was probably difficult to get Disney, Capcom, and Digital Eclipse back to the negotiating table.\n\nMan I loved Ducktales. I never owned a NES but I used to swap my Master System for one with a mate, and he had loads of games for it, so I played many of the classics at the time. Ducktales was one of my favourites.\n\nI really need to buy an NES and get DuckTales. Watching it on YouTube feels nice.\n\nBought this years ago on PS4. It’s a nice collection of Disney Capcom games. They should update this though. Add the SNES games of Goof Troop and Bonkers.\n\nWell it’s about time. I’d eat up a physical of this.\n\nI don't like using caps lock indiscriminately, but this one warrants it.\nABOUT. BLOODY. TIME!! <3\n\nIT'S FINALLY HAPPENING!!!\nOverjoyed. I cannot wait.\n\nDuck Tales a wooo oooo hums the theme\n\nWaited years for this and finally gave up and bought on Steam Deck a few days ago 😂\n\nWait, these are just the NES versions, nothing remade? 😐 Aren't some of them on the online service even?\n\n@NintendoWife \"Aren't some of them on the online service even?\" Nope! (hence why nobody has mentioned that and why people are excited)\nAnd yes, these are the original games in a smooth package that has display options, rewind features, etc. But the games are the games as originally produced.\n\nI've been waiting forever for this to come to Switch! It always felt like the biggest oversight but it's happening!!! I've got it on PC already but it always felt crazy that it wasn't on a modern Nintendo platform considering they are all NES games\n\n@Lofoten Agreed! A Capcom collection of Disney 16-bit games, especially the Magical Quest series and a Sega collection based around the Illusion series and Quackshot would be perfect. Two must-have game collections.\n\nI know I said multiple times on this site that I am not buying any new games this year, but a collection of old ones, especially one that I was vocal about wanting to have on the Switch? I can make an exception for that.\n\n@canaryfarmer Ok, I see. Well nothing wrong with that and to each their own. Myself I seem to not actually play games from that era anymore (the chance was there through two generations of Virtual Console and now two generations of the online service, in addition I bought the NES & SNES mini - not using any of them. So I've learned my lesson  )\n\nNice! I have this on xbox one, but seeing as it currently resides in a box in my closet, I might just get the switch version. Playing Rescue Rangers is probably one of my earliest gaming memories.\n\nWHOA. I've wanted this to come to the Switch forever. Huge fan of these games/The Disney Afternoon in general (see my avatar), so fingers crossed this comes out soon.\n\nThe fact that it took them the entire Wii U and Switch lifespan to re-release a bunch of old NES roms for Nintendo is just odd. The very fact that these are not NSO release is also odd cause since it's not NSO that means no online play on any of the games that had multiplayer mode. Also why not include Beauty and the Beast and The Little Mermaid in the collection too? Yes those are girlie games but they are still part of Disney's legacy, the fact that this collection is from Digital Eclipse means something bad is always bound to happen just like the Lion King, Aladdin, Jungle Book collection where we are still missing GBC, Game Gear, and Sega Master System versions of Aladdin and the Lion King. These fools don't know how to make a good collection.\n\nI know the Duck Tales games are fan favorites but don't sleep on the Rescue Rangers ones, they're awesome!\n\n@mlt I played Chip and Dale ALL the time! 😁\n\nI've been wanting this on Switch for the longest time! I like both Nintendo and Disney so I'm happy to see this.  As @Scapetti mentioned, I won't mind seeing the Magical Quest games get brought over, as well.\n\nI scrolled and see this while watching OG Ducktales! I listen to the Disney Afternoon album while I draw. I think this is dope news!\n\n@NeonPizza the thing that scares me with these is that we will end up with the Disney Afternoon Lag Collection, like they did with the Mega Man \"Lag\"ecy Collection on Switch.\n\nI bought this on PlayStation 4 a long long time ago. I played DuckTales because it was so well regarded. I thought it was decent but not as good as Capcom's other NES games such as Mega Man. I did enjoy the music a lot though - yes the Moon theme is popular, but I found myself partial to the Amazon theme more haha. I didn't play any of the other included games, though not for any particular reason, it just never happened.If I want to try out Chip and Dale, I will probably just boot up the PS4 version I already have instead of getting it again on Switch.....unless I see the Switch version on a deep deep discount, in which case the portability wins out for me.\n\nShadow drop for the next Nintendo direct\n\nBetter late than never.\n\n@EarthboundBenjy Chip n Dale is super fun if you're a little kid playing with your sibling, but it doesn't hold up if you're older. If you like Mega Man tho Darkwing Duck is great\n\nAbout time. I've been waiting for this for nearly a decade.\n\n@Tasuki\nProbably. lol Plus the emulated NES colours will look darker and desaturated vs the real thing. They can't get NES emulation colours to look right to this day. And expect a crappy CRT filter, although Capcom has great CRT filter options for their Arcade Collection Compilations.\nStill, DuckTales 2 & Chip & Dale 2 carts are mighty expensive. So this may be worth while for many! Yet neither DT2 or Cn'D2 are as good as the originals, and Tail Spin sucks. Darkwing duck is alright I guess.\nDT & Chip n Dale 1 are the stars imo, and both are affordable for NES. If only Analogue revised their NT Mini with a smaller redesign more aken to the NES and sold it for like $300 so we can play actual NES carts on an FPGA system with no latency or color issues, backed by quality CRT filters, on modern TV's.\nBut ya, I do have the Disney Afternoon Colleciton on PS5....But it just doesn't feel right playing it on PS5, with a DualSense controller. It belongs on Nintendo. \n\nOh neat, been wanting to have that one ported for a long time.\n\nPhysical release or bust!\nWhile you’re at it, to make up for the 9 year delay, throw in Ducktales Remastered, the recent Gargoyles digital only Remaster release and a few other 90’s Disney games too. This would be like printing money.\n\nFrankly, this collection doesn't interest me, and I didn't buy it on Steam despite its ridiculously low price, since I already have the original NES cartridges. What I did find a major oversight was that they didn't include The Little Mermaid, Mickey Mousecapade, Aladdin, Magical Quest 1 and 2, Bonkers, Adventures in the Magic Kingdom, Who Framed Roger Rabbit, or Goof Troop for SNES, and even worse, that they didn't include the Game Boy versions either.\n\n\"so why it's taken this long to come to Switch is beyond us\".\nLikely because it's a bunch of licensed games that would have required a new contract for new platforms. It's also very telling that the collection is not handled by Capcom (the original publisher), who might have not seen the idea as particularly profitable.\n\nI gave up waiting for this port and bought it on Steam years ago, but good to see this collection is finally coming to Switch, even if it did take an entire generation.\n\n@NeonPizza I remember renting both Ducktales 2 and Chip N Dale 2 back in the day and not being impressed with them. In fact I use to own a C.I.B. copy of Chip N Dale 2 that I bought from that same video store for $5. That was till I lost it in a fire a few years ago.\nTalespin was alright especially if you liked side scroller shooters. I remember beating that game once when I was a teenager. And as for Darkwing its just a Mega Man clone really. If I want to play it I'd just sooner play Mega Man 2 or 3.\nI have the collection for both PS4 and Xbox and yeah its just doesnt feel right playing with a PS4 or Xbox Controller. I guess a person can play it on PC and get a USB NES type controller for that more traditional feeling but still even those feel off.\n\n🎶🎵 Life is like a Hurr-i-caaane 🎵🎶\nI'd much rather have the DuckTales Remaster, but I'll still take this.\n\nI will be buying this if it's a physical game...\n\nABOUT FREAKING TIME!!!! I was just playing this on my PS5 a feeks ago wondering why it was still not on Switch.\n\n@HammerGalladeBro I would definitely love to play Alice no Paint Adventure by Epoch, using the Nintendo Switch 2's mouse function. I still remember music from that Donald Duck game!\nWell, better late than never, even if the Disney Collection's tardiness is obscene. I'll get it for my Switch 2, but I really hope the base collection gets updated with new titles!\n\nI am here for the eShop version, but hope there is a physical release for those that want it. 🙂\n\nDarkwing Duck on the Switch? He is the terror that flaps in the night! He is the unpatched bug that corrupts the save file in a game you've 95% completed! Let's get dangerous!\n\nSomeone at Disney was like why isn't this on the Switch 7 years late. 😆\n\nI bought the collection on Steam during the Winter Sale and yes, it is a pretty good collection! I grew up on these games and for me this was a dream that came true\n\nNow if only we could get a collection with Quackshot, Castle and World of Illusion\n\nFINALLY!!! 💖 Been waiting yesrs for this!\n\nI hope they add more games to the switch release like the Gameboy versions or possibly other DA games like Bonkers or Goof Troop.\n\nThanks, Wade\nhttps://www.youtube.com/watch?v=O_cqEY_xhDU\n\nDigital, day one!\n\nHoly cow, both Duck tales games and both Rescue rangers games. Totally worth your money, amazing collection!! 🥰🥰🥰\n\nOnly 9 years late for Switch 1.\n\nGeez. What took so long??\nNeeds the modern Ducktails remake and sega genesis Quackshot!\n\nOh, hell yes. Finally Rescue Rangers and DuckTales 2. Didn't even know there was a Rescue Rangers 2, but I'll be playing it now.\n\n@WoomyNNYes These are Capcom games for the NES. Quackshot was a Genesis game developed and published by Sega.\n\nI got tired of waiting for a Switch release years ago and bought Disney Afternoon Collection on PS4. It's very good, though some of the games have not aged as well as I had hoped. DuckTales is still fantastic and practically worth the price alone.\n\nYusssssssssss\n\nWas I the only one that read this headline, screamed, and thrust his hands in the air??\nOn IGN's \"Top 100 NES Games of All Time\" list:\nOn NL's \"50 Best NES Games of All Time\" list (that's ranked by you and me!):\nDuckTales will get all of the hype. And it's great.\nBut for me, Chip 'n Dale: Rescue Rangers was THE best game to play with your little sister. It's fun, it's short, it's co-op, and it's on the easy side. And I'm going to play it with my (now much bigger) little sister as soon as it hits my Switch 2!\n\nI was obsessed with the NES Darkwing Duck game. I still randomly jump into to this day, it’s such an underrated gem.\n Show Comments\nLeave A Comment\nHold on there, you need to login to post a comment...\n\nNintendo Expands Switch 2's GameCube Library With Another Game\nFire Emblem is the first release of 2026\n\nSuper Mario Bros. Wonder - Nintendo Switch 2 Edition + Meetup In Bellabel Park Has Been Rated\nGet ready for a 2026 release\n\nNintendo Switch 2 System Update 21.2.0 Is Now Live, Here Are The Full Patch Notes\nThe first update of 2026 is also available for Switch\n\nMini Review: Stardew Valley: Nintendo Switch 2 Edition - Almost The Cream Of The Crop\nA farm where you'll want a mouse\n\nNintendo Reveals First New Joy-Con 2 Colours For Switch 2\nPastels are in\n 6\nRandom Feeling Blue? This 91-Year-Old Zelda Fan Will Make Your Day\n 12\nNews \"He Is Amazing\" - Mario Voice Actor Kevin Afghani Heaps Praise On Charles Martinet\n 14\nNews Sega Is Adding Playable Bandai Namco Game Gear Titles To Yakuza Kiwami 3\n 16\nNews Nintendo's First Game Trial Of 2026 Is Exclusive To Switch 2 (North America)\n 111\nNews GameStop Kicks Off 2026 By Reportedly Shutting \"Hundreds\" Of Stores\nNews Nintendo Expands Switch 2's GameCube Library With Another Game\nOpinion The Nintendo Console Nobody Wanted To Review Returns Soon, And I'm Here ...\nNews Nintendo Denies Using AI Images In New 'My Mario' Marketing\nRumour Bethesda Is Reportedly Reviving Two More Fallout Games\nNews Super Mario Bros. Wonder - Nintendo Switch 2 Edition + Meetup In Bellabe...\nNews Nintendo Switch 2 System Update 21.2.0 Is Now Live, Here Are The Full Pa...\nNews More Switch Games Have Received Switch 2 Compatibility Updates\nMini Review Stardew Valley: Nintendo Switch 2 Edition - Almost The Cream Of The Crop\nNews Nintendo Reveals First New Joy-Con 2 Colours For Switch 2\nReview Fire Emblem: Path Of Radiance (GameCube) - Aged & Easier Than You're Use...\nPopular Right Now\nShow More \nJoin 1,561,305 people following Nintendo Life:\n© 2026 Hookshot Media, partner of IGN Entertainment | Hosted by 44 Bytes |  AdChoices | Do Not Sell My Personal Information"
    },
    {
        "source": {
            "id": null,
            "name": "Warhammer-community.com"
        },
        "author": null,
        "title": "Four contestants test their creativity to make Rogue Traders and retinues on Scrap Demon - Warhammer Community",
        "description": "What to watch on Warhammer TV this week.",
        "url": "https://www.warhammer-community.com/articles/sgsr7vwj/four-contestants-test-their-creativity-to-make-rogue-traders-and-retinues-on-scrap-demon",
        "urlToImage": "https://assets.warhammer-community.com/whplus-jan14-1-feature-bmrktiza2g.jpg",
        "publishedAt": "2026-01-14T12:56:44Z",
        "content": "You are currently on the English site. Choose another country or region to see content specific to your location.\nKey news in:\nKey news in:\nJoin the conversation\nFour contestants test their creativity to make Rogue Traders and retinues on Scrap Demon\nWe don’t know about you, but here in the Warhammer Community team we’re almost buried under a glorious heap of new miniatures that we got for Christmas. With such a huge pile of potential at our fingertips, we’re wondering if we should throw caution to the wind and kitbash something crazy.* \nFinding inspiration in a big stack of sprues is the name of the game on Scrap Demon too. The show pits four contestants against each other, challenging them to create something really cool out of a big selection of sprues in order to impress our judge and win the coveted Scrap Demon trophy.\nThe challenge for this week’s episode is to create a Rogue Trader and retinue. We caught up with contestants Ben and Ollie to ask what goes through the mind when sitting in front of a daunting mound of plastic, with a singular task at hand.\nOllie: What do you do when faced with a massive pile of sprues? Honestly you can't go wrong! Personally, I like to look for specific parts that I find exciting rather than trying to make a concrete plan – wings, funky helmets, super cool weapons, etc. Being an Iron Hands lover, any sort of robotic limb or cybernetic part will definitely be sought after! I'm of the belief that if you gather up enough awesome parts, a cool converted scrap masterpiece will create itself.\nNot to say that you shouldn't have some kind of vague plan, but you definitely don't need one to make something epic... or, several epic things! I've watched loads of Scrap Demon episodes before, but was pleasantly surprised to discover that rather than create one big model, we had to create a whole squad instead. This meant I was even less worried about having a strong plan as I had six attempts to make something awesome. Throw enough things at the wall and eventually something will stick... Just don't forget the plastic glue!\nBen: Clearly what you don’t do is just charge headlong in there, excitedly grabbing as many bits as you can because they look cool, or happen to be within reach, and then hope for the best! No sir, that’s not me. I’m a very meticulous planner…\nAlright, this is a lie. Plans lead to things like following instructions or knowing where you’re going, and they don’t lead to Chaos. No, I prefer to sail more whimsical seas. Bring on the Warp, bring on the wonkiness, bring on the last-minute adrenaline rush that leads to desperate action!\nThankfully, the aim of this episode was for us to make a whole crew of kitbashed spacefarers who thrive outside the bounds of the Imperium’s norms. This left me loads of license for creating whatever weird brain-spawn I could, but one component made all the difference – the cat from the Saviours of Cinderfall kit!\nShip’s felids must still be about in the 41st Millennium, right? I bet they’re valuable too. A perfect statement piece for my Rogue Trader…\nYou’ll have to tune in to this week’s episode of Scrap Demon to find out how things worked out, and see some extremely cool Rogue Trader crews in the process!\nAmbitious kitbashing isn’t the only thing on Warhammer TV. A Warhammer+ subscription will get you access to hundreds of hours of interviews, battle reports, entertaining shows, and incredible Warhammer animations. Your subscription also gets you a free miniature every year, alongside extras like the Warhammer Vault and expanded army creation options in the Warhammer 40,000 and Warhammer Age of Sigmar apps. On top of that, there are merch discount codes every month, and more! Subscribe now!\nThat’s not all there is on Warhammer TV this week. On Loremasters, Alex provides us with a comprehensive overview of the Indomitus Crusade, covering the vast fleets brought together in order to fight back against the many threats that have beset Imperium Sanctus, and the trials and tribulations they’ve gone through. It’s a great way of getting caught up with what has been going on in the galaxy, ahead of the mysterious events currently unfolding.\nFinally, if you’re looking for some discussion on the nuts and bolts of the game of Warhammer 40,000, then you can tune in to Victory Pointers, where Warhammer TV’s Joshua sits down with game developer Josh (that’s not going to get confusing…) to chat about the intricacies of Primary and Secondary Missions. We’re sure it’s going to be an objective discussion. Ahem.\nEverything mentioned above is available to watch on Warhammer TV right now – alongside more than 600 other episodes of Warhammer shows and animations – for anyone with a Warhammer+ subscription. By signing up for a year, you’ll also get to choose one of two awesome diorama miniatures for free, as well as gaining access to unlimited army creation in the Warhammer 40,000 and Warhammer Age of Sigmar apps. To choose your miniature, redeem codes from Codexes and battletomes, and to enter the Warhammer Vault (which is full of information from past publications) you just need to log into your MyWarhammer account.\n\n* WarCom boss Andy has enough extensive kitbash ideas for Dark Angels and Orks to last him more than a few decades of hobbying, we reckon.\nWant to be among the first to find out the latest news, promotions, hobby tips, new product releases, teases, competitions and more from the world of Warhammer? Of course you do. \nPop in your details below, and we'll send your inbox all sorts of awesomeness.\n© Copyright Games Workshop Limited 2026. GW, Games Workshop, Citadel, White Dwarf, Space Marine, 40K, Warhammer, Warhammer 40,000, the ‘Aquila’ Double-headed Eagle logo, Warhammer Age of Sigmar, Battletome, Stormcast Eternals, and all associated logos, illustrations, images, names, creatures, races, vehicles, locations, weapons, characters, and the distinctive likenesses thereof, are either ® or ™, and/or © Games Workshop Limited, variably registered around the world. All Rights Reserved.\n© New Line Productions, Inc. All rights reserved. THE LORD OF THE RINGS TRILOGY and the names of the characters, items, events and places therein are trademarks of Middle-earth Enterprises, LLC under license to New Line Productions, Inc. (S26)\n© Warner Bros. Entertainment Inc. All rights reserved. MIDDLE-EARTH, THE LORD OF THE RINGS: THE WAR OF THE ROHIRRIM and the names of the characters, items, events and places therein are ™ of Middle-earth Enterprises, LLC under license to New Line Productions, Inc. (s26)\n© Warner Bros. Entertainment Inc. All rights reserved. THE HOBBIT TRILOGY and the names of the characters, items, events and places therein are trademarks of Middle-earth Enterprises, LLC under license to New Line Productions, Inc. (s26)\nMiddle-earth, The Hobbit and The Lord of the Rings and the names of the characters, places, items and events therein, are trademarks of Middle-earth Enterprises, LLC used under license by Games Workshop. All rights reserved. (s26)\nAny use of website content to train generative artificial intelligence (AI) technologies is expressly prohibited.\nStart Typing to Search"
    },
    {
        "source": {
            "id": null,
            "name": "Android Authority"
        },
        "author": null,
        "title": "New Pixel 10a leak reveals price, exact launch date - Android Authority",
        "description": "The Google Pixel 10a is now expected to launch next month, and a leaker has now apparently revealed pricing and a specific launch date.",
        "url": "https://www.androidauthority.com/google-pixel-10a-price-launch-date-leak-3632254/",
        "urlToImage": "https://www.androidauthority.com/wp-content/uploads/2025/10/Pixel-10a-render-2.jpg",
        "publishedAt": "2026-01-14T07:46:11Z",
        "content": "TL;DR A leaker has claimed that the Pixel 10a could launch on February 17, citing retailer listings.\n\nThey also assert that the 128GB model will cost ~$582 in Europe, while the 256GB model will cost ~$699.\n\nThis would be cheaper than the Pixel 9a’s European launch pricing.\n\nWe’ve seen a couple of major Google Pixel 10a leaks in the last day or so, and it looks like the news isn’t slowing down just yet. A tipster has now revealed apparent pricing and a claimed launch date for the mid-range phone.\n\nLeaker @MysteryLupin on Twitter has claimed that the Pixel 10a will launch on February 17, citing unnamed retailer listings. This broadly lines up with WinFuture journalist Roland Quandt’s “mid-February” claim.\n\nDon’t want to miss the best from Android Authority? Set us as a favorite source in Google Discover to never miss our latest exclusive reports, expert analysis, and much more.\n\nto never miss our latest exclusive reports, expert analysis, and much more. You can also set us as a preferred source in Google Search by clicking the button below.\n\nThe tipster adds that the 128GB Pixel 10a will apparently retail for roughly €500 (~$582) in Europe, while the 256GB model could retail for approximately €600 (~$699). This would be cheaper than the Pixel 9a, which launched at €549 (~$639) and €649 (~$756) respectively. These lower prices would be great news if confirmed, but there’s no guarantee that the Pixel 10a will be cheaper in other markets (e.g., the US and UK).\n\nThe 128GB model could arrive in Obsidian, Berry, Lavender, and Fog. However, Lupin asserts that the 256GB variant will only be available in Obsidian. It’s unclear if other markets will see more colors for the 256GB model. Otherwise, it’s believed that Pixel 10a cases will cost roughly €20 (~$23).\n\nPrevious Pixel 10a leaks point to a Tensor G4 chipset (in line with the Pixel 9a), 8GB of RAM, and a 5,100mAh battery. The phone could also pack a 48MP+13MP dual rear camera setup and a 13MP selfie shooter. Either way, it looks like the new phone could have a lot in common with the Pixel 9a.\n\nFollow"
    },
    {
        "source": {
            "id": null,
            "name": "MacRumors"
        },
        "author": "Joe Rossignol",
        "title": "Google Gemini-Powered Siri Will Reportedly Have These 7 New Features - MacRumors",
        "description": "Apple and Google this week announced that Gemini will help power a more personalized Siri, and The Information has provided more details.   As soon...",
        "url": "https://www.macrumors.com/2026/01/13/google-gemini-siri-capabilities-report/",
        "urlToImage": "https://images.macrumors.com/t/O2PQxJzVD0_2JrNy6sds2OIjixE=/1600x/article-new/2025/03/iOS-18-Siri-Personal-Context.jpg",
        "publishedAt": "2026-01-14T03:52:00Z",
        "content": "Apple and Google this week announced that Gemini will help power a more personalized Siri, and The Information has provided more details.\nSubscribe to the MacRumors YouTube channel for more videos.As soon as this spring, the report said the revamped version of Siri will be able to…\n\nThe report said Apple plans to announce additional Siri capabilities at WWDC in June, including… \nApple already announced that the personalized Siri would have better understanding of a user's personal context, on-screen awareness, and deeper per-app controls, so a lot of the specific capabilities that the report said are coming would align with that.\nFor example, Apple showed an iPhone user asking Siri about their mother's flight and lunch reservation plans based on info from the Mail and Messages apps.\nThe report said that the latest prototype of the more personalized Siri does not have any Google or Gemini branding, and Apple will be able to fine-tune Gemini's model to ensure that Siri responds to queries in a way that the iPhone maker prefers.\nMore details are available in The Information's paywalled report.\nApple first previewed the more personalized Siri at WWDC 2024, and the revamped assistant is finally expected to launch as part of iOS 26.4 in March or April. However, according to the report, some capabilities will not arrive until iOS 27.\nGet weekly top MacRumors stories in your inbox.\nOur comprehensive guide highlighting every major new addition in iOS 26, plus how-tos that walk you through using the new features.\nReminder alarms, more Liquid Glass tweaks, AirDrop improvements, and more.\nNew features and lesser-known changes to check out if you're upgrading.\nApple's four new iPhones feature more differences between the latest models than ever before, so which one should you buy?\nUpgrade to A17 or newer chip with Apple Intelligence support, plus Apple's new N1 wireless networking chip.\nUpgraded item tracker with improved range, anti-tamper improvements, and more.\nFaster chips and new colors expected.\nChip-bump update to M5.\n17 hours ago by Joe Rossignol\n3 days ago by Tim Hardwick\n3 days ago by Tim Hardwick\n3 weeks ago by Tim Hardwick\n3 weeks ago by Tim Hardwick\n \nMacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPad, Mac, and other Apple platforms."
    },
    {
        "source": {
            "id": null,
            "name": "Theregister.com"
        },
        "author": "Jessica Lyons",
        "title": "Windows info-disclosure 0-day bug gets a fix as CISA sounds alarm - theregister.com",
        "description": ": First Patch Tuesday of 2026 goes big",
        "url": "https://www.theregister.com/2026/01/14/patch_tuesday_january_2026/",
        "urlToImage": "https://regmedia.co.uk/2022/04/19/zero_day_bug_software_shutterstock.jpg",
        "publishedAt": "2026-01-14T00:36:00Z",
        "content": "Microsoft and Uncle Sam have warned that a Windows bug disclosed today is already under attack.\n\nThe flaw, tracked as CVE-2026-20805 and discovered by Microsoft's own threat intel team, allows an authorized attacker to leak a memory address from a remote ALPC port.\n\n\"Presumably, threat actors would then use the address in the next stage of their exploit chain – probably gaining arbitrary code execution,\" according to Trend Micro's Zero Day Initiative Head of Threat Awareness Dustin Childs' analysis.\n\nIt's a medium-severity flaw, earning a 5.5 CVSS rating.\n\nShortly after Redmond pushed a patch, the US Cybersecurity and Infrastructure Security Agency added CVE-2026-20805 to its Known Exploited Vulnerabilities catalog, a step that means federal agencies must implement the fix by February 3. \"This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise,\" the feds warned.\n\nWhile we don't know who is abusing this hole, nor how widespread the exploitation is. Microsoft declined to answer our questions on the matter, so we'd suggest putting this patch at the top of the list.\n\n\"Vulnerabilities of this nature are commonly used to undermine Address Space Layout Randomization (ASLR), a core operating system security control designed to protect against buffer overflows and other memory-manipulation exploits,\" Kev Breen, senior director of cyber threat research at Immersive, told The Register.\n\n\"By revealing where code resides in memory, this vulnerability can be chained with a separate code execution flaw, transforming a complex and unreliable exploit into a practical and repeatable attack,\" he added, while also dinging Redmond for not disclosing which other components may be involved in such an exploit chain.\n\nThat omission, Breen said, \"significantly\" limits network defenders' \"ability to proactively threat-hunt for related activity. As a result, rapid patching currently remains the only effective mitigation.\"\n\nTwo publicly known bugs\n\nCVE-2026-20805 looks to be Microsoft's first zero-day bug of 2026, appearing on the first Patch Tuesday of the new year – and the patch dump is a whopper, with 112 Microsoft CVEs disclosed.\n\nOf these, Microsoft lists two others as publicly known at the time of the release.\n\nOne of these, CVE-2026-21265, is a secure boot certificate expiration security feature bypass vulnerability, with a 6.4 CVSS rating. It's listed as publicly known because Microsoft published this certificate expiration notice back in June 2025.\n\nSome of the original certificates issued in 2011 are expiring soon, and operators of devices that use the soon-to-expire certificates need to update them – or lose the operating system's Secure Boot protections and security updates. As Childs noted, \"while unlikely to be exploited, this bug could cause quite a bit of headaches for administrators.\"\n\nThe other publicly known vulnerability, CVE-2023-31096, is a 7.8-rated elevation of privilege flaw in third-party Agere Modem drivers that ship with supported Windows versions. It's a non-Microsoft CVE that has to do with a flaw first documented in 2023 (CVE-2023-31096) and issued by MITRE.\n\nDuring October's patch-a-thon, Microsoft warned that this Agere Modem driver security hole had been made public, but not yet exploited, and said it would be removed in a future update. The future is now, and the drivers have been removed as of the January update.\n\nA couple of other interesting bugs that Childs points out are these two, CVE-2026-20952 (CVSS 7.7) and CVE-2026-20953 (CVSS 7.4), both use-after-free Office flaws that can allow an unauthorized attacker to execute code locally.\n\n\"Another month with Preview Pane exploit vectors in an Office bug,\" Childs wrote. \"While we are still unaware of any exploitation of these bugs, they keep adding up. It's only a matter of time until threat actors find a way to use these types of bugs in their exploits.\" ®"
    },
    {
        "source": {
            "id": null,
            "name": "9to5google.com"
        },
        "author": "Abner Li",
        "title": "‘Android 17’ split Notifications & Quick Settings panels leak in full [Gallery] - 9to5Google",
        "description": "A split of Android Notifications and Quick Settings has been rumored for the past year or so, and a leak...",
        "url": "http://9to5google.com/2026/01/13/android-notifications-quick-settings-split/",
        "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2025/11/Android-logo.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "publishedAt": "2026-01-13T23:37:00Z",
        "content": "A split of Android Notifications and Quick Settings has been rumored for the past year or so, and a leak today provides the latest look.\n\nMystic Leaks on Telegram today shared a video and screenshot of what might be an internal build of Android 17. The design is a maturation of what was previously shown. Under Settings > Notifications, there will be a new “Notifications & Quick Settings” menu with two options:\n\nSeparate : Swipe down from the top right to open Quick Settings. Swipe down from the top left to open notifications.\n\n: Swipe down from the top right to open Quick Settings. Swipe down from the top left to open notifications. Combined (classic): Swipe down from the top of your screen to access the classic panel that combines notifications and Quick Settings.\n\nWhen the “Separate” option is enabled, swiping from the left shows notifications. There are no changes to the actual list as of this build, but you get a large clock at the top. The day/date and status bar icons are placed in pills at the corners.\n\nA swipe down from the right side of the screen shows Quick Settings, which is placed in a (top) sheet container. You get a miniature clock here, while the next two rows offer carrier information, QS edit, settings, and power.\n\nAdvertisement - scroll for more content\n\nA new addition to Quick Settings is the volume slider underneath brightness. The three-dot button next to it presumably opens the full set of sliders. Otherwise, the QS tiles are unchanged from their last redesign.\n\nOn large screens, Separate will be the only option: “Combined (classic) view is limited to the outer screen of your foldable device.”\n\nMeanwhile, Android 17 is said to bring back a dedicated “Mobile Data” Quick Settings tile, which would use a cellular bar icon. The separate Wi-Fi toggle uses the icon you’d expect."
    },
    {
        "source": {
            "id": null,
            "name": "Nintendoeverything.com"
        },
        "author": "Brian",
        "title": "Pokemon Brilliant Diamond and Shining Pearl finally fixed on Nintendo Switch 2, plus other Switch 1 backwards compatibility updates - Nintendo Everything",
        "description": "It took a bit of time, but Pokemon Brilliant Diamond and Pokemon Shining Pearl have finally been fixed on Nintendo Switch 2 when playing the games via backwards compatibility. The Nintendo eShop pages confirm that everything is good to go. We previously heard…",
        "url": "https://nintendoeverything.com/pokemon-brilliant-diamond-and-shining-pearl-finally-fixed-on-nintendo-switch-2-plus-other-switch-1-backwards-compatibility-updates/",
        "urlToImage": "https://nintendoeverything.com/wp-content/uploads/Pokemon-Brilliant-Diamond-Shining-Pearl-fixed-Switch-2.jpg",
        "publishedAt": "2026-01-13T23:05:12Z",
        "content": "Submit a news tip\n☰\n\nIt took a bit of time, but Pokemon Brilliant Diamond and Pokemon Shining Pearl have finally been fixed on Nintendo Switch 2 when playing the games via backwards compatibility. The Nintendo eShop pages confirm that everything is good to go.We previously heard that both titles were causing crashing issues. It wasn’t something happening every time, but it was a problem that was fairly widespread within the Pokemon community.According to Nintendo, previously identified issues affecting Pokemon Brilliant Diamond and Shining Pearl have been resolved with an update. That should refer to system firmware version 21.2.0, which was made available on both Nintendo Switch 2 and Switch yesterday. You can read more about that update here.Another game has also been fixed with the update – Cats on Duty. This is also now in working order following the latest firmware drop.In other news, Nintendo has identified an issue with Kirby’s Return to Dream Land Deluxe. While the game functions on Nintendo Switch 2, players may experience audio problems in some areas.News about other backwards compatibility fixes can be found here, here, here, here, here, here, here, and here.\nIt took a bit of time, but Pokemon Brilliant Diamond and Pokemon Shining Pearl have finally been fixed on Nintendo Switch 2 when playing the games via backwards compatibility. The Nintendo eShop pages confirm that everything is good to go.\nWe previously heard that both titles were causing crashing issues. It wasn’t something happening every time, but it was a problem that was fairly widespread within the Pokemon community.\n\nAccording to Nintendo, previously identified issues affecting Pokemon Brilliant Diamond and Shining Pearl have been resolved with an update. That should refer to system firmware version 21.2.0, which was made available on both Nintendo Switch 2 and Switch yesterday. You can read more about that update here.\nAnother game has also been fixed with the update – Cats on Duty. This is also now in working order following the latest firmware drop.\nIn other news, Nintendo has identified an issue with Kirby’s Return to Dream Land Deluxe. While the game functions on Nintendo Switch 2, players may experience audio problems in some areas.\nNews about other backwards compatibility fixes can be found here, here, here, here, here, here, here, and here.\n About Review Policy Privacy Policy Contact us\nReviews Features Podcasts News\n     \n© Copyright 2026\n"
    },
    {
        "source": {
            "id": null,
            "name": "Kotaku"
        },
        "author": "Ethan Gach",
        "title": "Fallout 4 Mod Turns Todd Howard Into A Deadly Cardboard Cutout - Kotaku",
        "description": "It's a bird, it's a plane, it's a Wasteland snail disguised as Bethesda's legendary designer",
        "url": "https://kotaku.com/todd-howard-fallout-4-mod-blurbs-youtube-2000659450",
        "urlToImage": "https://kotaku.com/app/uploads/2026/01/Fallout-mod.jpg",
        "publishedAt": "2026-01-13T22:03:19Z",
        "content": "\nFallout 4 \nFallout 4‘s New England wasteland is full of all manner of abominations. You can now add a mutant snail masquerading as a cardboard cutout of Todd Howard to that list. Twitch streamer Blurbs modded it into the game for his latest playthrough. The scariest part? Let Howard catch you and you automatically die. “It just works.”\nThat’s a famous line the veteran Bethesda designer uttered on stage at E3 2015 when describing crafting in Fallout 4. It is not a good way to describe Blurbs’ latest mod, which includes other wasteland hijinks like NPCs randomly exploding and dogs raining from the sky. A video uploaded to YouTube shows all of it in action:\nBlurbs took a snail mod for Fallout 4 and swapped the model with a picture of Howard, with the condition that the player dies if the two ever collide. Easy to avoid because it moves so slowly, unless you aren’t paying attention and the Starfield director quietly ambushes you from behind.\nMy favorite part is the low-budget cardboard cutout slowly following Blurbs around the map, even when he’s in the middle of a conversation with an NPC. In fact, seeing the 2D developer poking out of the far side of the frame is the most terrifying part of the whole thing. Let’s see how many other games killer Todd can be modded into before Fallout 5 launches.\nDonât miss the latest reviews, news and tips. Sign up for our free newsletter.\n\n          The Brotherhood of Steel doesnât have it easy in Oshiiâs Commonwealth\n        \n\n          Also: The Witcher 3's Geralt defends his new Netflix counterpart\n        \n\n          Bethesda has, once again, updated its popular RPG and made it worse in the process\n        \n\n          This is the first mainline Fallout game to arrive on a Nintendo console\n        \n\n          The Death Stranding 2 director thought a dream diary would help him sleep better\n        \n\n          Where was Gondor when my credit card payment failed?\n        \nWe may earn a commission when you buy through links on our sites.\nÂ©2026 KOTAKU USA LLC. All rights reserved.\nMode\n\n                Follow us\n              \nMode\n\n                Follow us\n              "
    },
    {
        "source": {
            "id": null,
            "name": "Gizmodo.com"
        },
        "author": "Bruce Gil",
        "title": "Signal’s Founder Turns His Attention to AI’s Privacy Problem - Gizmodo",
        "description": "Confer, an open source chatbot, encrypts both prompts and responses so companies and advertisers can’t access user data.",
        "url": "https://gizmodo.com/signals-founder-turns-his-attention-to-ais-privacy-problem-2000709897",
        "urlToImage": "https://gizmodo.com/app/uploads/2026/01/moxie_marlinspike_signal-1200x675.jpg",
        "publishedAt": "2026-01-13T21:40:20Z",
        "content": "\n                Reading time 2 minutes\n      \nThe founder of Signal has been quietly working on a fully end-to-end encrypted, open-source AI chatbot designed to keep usersâ conversations secret.\nIn a series of blog posts, Moxie Marlinspike makes clear that while he is a fan of large language models, heâs uneasy about how little privacy most AI platforms currently provide.\nMarlinspike argues that, like Signal, a chatbotâs interface should accurately reflect whatâs happening under the hood. Signal looks like a private one-on-one conversation because it is one. Meanwhile, chatbots like ChatGPT and Claude feel like a safe space for intimate exchanges or a private journal, even though usersâ conversations can be accessed by the company behind them and sometimes used for training.\nIn other words, if a chatbot feels like youâre having a private conversation, Marlinspike says it should actually work that way too.Â \nHe says this is especially important because LLMs represent the first major tech medium that âactively invites confession.â As people chat with these systems, they end up sharing a lot about how their brain works, including thinking patterns and uncertainties.Â \nMarlinspike warns that this kind of info could easily be turned against users, with advertisers eventually exploiting insights about them to sell products or influence behavior.\nHis proposed solution is Confer, an AI chatbot that encrypts both prompts and responses so that only the user can access them.Â \nâConfer is designed to be a service where you can explore ideas without your own thoughts potentially conspiring against you someday; a service that breaks the feedback loop of your thoughts becoming targeted ads becoming thoughts; a service where you can learn about the world â without data brokers and future training runs learning about you instead,â wrote Marlinspike\nSignal was founded in 2014 around similar principles, and its open-source encrypted messaging protocol was eventually adopted by Metaâs WhatsApp just a few years later. So, it’s possible Meta and other tech giants could eventually adopt Conferâs technology as well.\nAccording to Marlinspike, Confer is designed so that usersâ conversations are encrypted before they ever leave their devices, similar to how Signal works.\nPrompts are encrypted on a userâs computer or phone and sent to Conferâs servers in that form, then decrypted only in a secure data environment to generate a response.\nConfer does this by using a mix of security tools. Instead of traditional passwords, it uses passkeys, such as Face ID, Touch ID, or a device unlock PIN on verified usersâ devices, to derive encryption keys.Â \nWhen it comes time for the AI to respond, Confer uses what it calls confidential computing, where hardware-enforced isolation is used to run code in a Trusted Execution Environment (TEE).\nâThe host machine provides CPU, memory, and power, but cannot access the TEEâs memory or execution state,â Marlinspike explained.\nWith the LLMâs âthinking,â or inference, running in a confidential virtual machine, the response is then encrypted and sent back to the user.\nThe hardware also produces cryptographic proof, known as attestation, that allows a userâs device to verify that everything is running as it should.\nAll of this is done to keep usersâ data secure, and not, as Marlinspike puts it, sent to âa data lake specifically designed for extracting meaning and context.â\nExplore more on these topics\n\n  Share this story\n\n\n        Subscribe and interact with our community, get up to date with our customised Newsletters and much more.\n      \n\n          Follow along with Gizmodo as we check out all the latest gadget announcements from the year's biggest, most-packed tech event, CES 2026.\n        \n\n          The commissioners of Laramie County, Wyoming, unanimously voted to build a data center campus that will be designed to scale to 10 gigawatts.\n        \n\n          While 6x frame gen wonât be here until spring, better AI upscaling is more than welcome.\n        \n\n          Microsoft's AI assistant hallucinated a soccer match.\n        \n\n          A win for advocacy!\n        \n\n          \"We will win this race by becoming an AI-first war-fighting force across all domains,\" the Defense Secretary said Monday.\n        \nÂ©2025 GIZMODO USA LLC.\nAll rights reserved."
    },
    {
        "source": {
            "id": null,
            "name": "Pure Xbox"
        },
        "author": "Fraser Gilbert",
        "title": "Xbox Legend Major Nelson Announces He's Been Laid Off From Unity - Pure Xbox",
        "description": "We miss you at Xbox, Larry!",
        "url": "https://www.purexbox.com/news/2026/01/xbox-legend-major-nelson-announces-hes-been-laid-off-from-unity",
        "urlToImage": "https://images.purexbox.com/494d23ddc3f80/large.jpg",
        "publishedAt": "2026-01-13T19:55:02Z",
        "content": "Guest\nGuest\nLogin | Sign Up\nPure Xbox\n\nGuest\nLogin or Sign Up\nWe miss you at Xbox, Larry!\nWe've spoken about Major Nelson many times here at Pure Xbox — he's known for having been the face of Xbox marketing for over two decades until he left Microsoft in 2023, while also working on tons of other features at Xbox over the years including achievements, Party Chat, cloud saves, in-game messaging and a whole lot more.\nFollowing his departure from Xbox a couple of years ago, Major Nelson (real name Larry Hryb) revealed in early 2024 that he was joining the community team at Unity, specifically as a \"director of community and advocacy\".\n\nHe's back!\nUnfortunately, Hryb has taken to social media today to announce that he's been laid off from Unity, highlighting that he's \"proud of the goals my team and I accomplished in just 18 months\", but that he's also excited for his next chapter.\nHere's a look at his announcement:\nHe even went on to poke fun at himself with a custom Xbox \"achievement unlocked\" banner:\nThe well-wishes have been pouring in from across the industry in the hours since this announcement, with many suggesting that Hryb should return to Xbox, although we're assuming that's not on the cards (as much as we'd love it!).\nWhatever happens next, we send our best regards — he'll surely have plenty of offers!\nJust for fun, here's a look at a Major Nelson Xbox video from all the way back in 2004:\n\nWould you be happy with shorter games?\n\n\"One of the most magical professional moments of my career\"\nAbout Fraser Gilbert\n\nFraser is the News Editor at Pure Xbox, where he spends his time reporting on the biggest stories in the world of Xbox and beyond.\nComments 13\n\nXbox could use someone with his marketing talent.\n\nRemoved - inappropriate\n\nWhat a funny achievement. I hope he gets to see the real side of what many Americans are facing.\n\nI wonder what Trixie360 is up to?\n\nIsn’t Unity the company that tried to make people pay per installation at exorbitant rates?\nIf so, he’s probably better off looking for another position anyway. Unity still has egg on their face from that.\n\nSometimes I miss him being at Xbox. He was their greatest asset in marketing and communication. But even if he were still there, he'd be tasked with the unenviable position of announcing price increases on mid-cycle consoles.\n\nI used to watch him on \"This week on XBox\", when it showed up on the feed in my XBox One. When he left, I stopped watching. There was something about him that was captivating. He clearly has a passion for games. I'm sure he'd be a great asset back at XBox.\n\nI said to my wife when Larry went to Unity that, if I were working in that space, Unity is the absolute last place I'd go. Had he not been paying attention to what the company was up to, oh I don't know, around September 2023?\n\nWishing Larry all the best along with many others laid off. I miss his frank honesty and earnestness as the go-between between Xbox and fans but I don't think that would work with Microsoft's current policies and practices.\n\n@Markatron84 People go to where they see an opportunity to make money with the skills they have. Maybe Larry Hryb thought he can have an impact and make some significant changes, but mostly met obstacles and dead ends.\nShawn Layden also joined the Tencent Games as a strategic adivsor in 2022, after he left PlayStation/SIE, and already left Tencent 2 years later.\nWhile \"Major Nelson\" definitely contributed a lot to Xbox's public success, I wonder if he would fit into the current \"Xbox\" organization, where Microsoft heavily reduced marketing budget.\n\n@Naughtyottsel92 fairly confident that had nothing to do with it. He spent 20 years at Microsoft, the management at unity no doubt employed him based on the work he’d done with Xbox, they knew what they were getting.\nThe vast majority of industry related layoffs in the past year or so have had a lot more to do with unsustainable development budgets and a lot less to do with being bad at your job.\n\nHe may been bored with job after so many years. But wish he never left Xbox.\n\nI hope Larry manages to find something in gaming again soon. I enjoyed his videos, podcasts and presentations when at Xbox, so I wish him well 😊\n Show Comments\nLeave A Comment\nHold on there, you need to login to post a comment...\n\nXbox Game Pass: All Games Coming Soon In January 2026\nAll the confirmed reveals so far\n\nXbox Gives Refunds For Red Dead Redemption Following Recent Upgrade Issues\nIf you bought it unnecessarily, you might be getting that money back!\n\nEight Free-To-Play Games To Look Forward To On Xbox In 2026\nIncluding some pretty massive releases!\n\nStar Wars Genesis Creator Explains Why Viral Starfield Mod Is 'Never' Coming To Xbox\nNever say never!\n\nFive Xbox Game Pass Titles Get New Reveals At The New Game Plus Showcase 2026\nThree from Xbox Game Studios, two from third-party teams\n 0\nNews Four New Games Added To Retro Classics On Xbox Game Pass In January 2026\n 1\nNews Middle-Earth: Shadow Of War Players Warn Of Ongoing Issue With The Xbox PC Version\n 6\nNews Forza Horizon 5 PS5 Sales Beat Sony's Biggest 2025 Exclusive In Europe, Other Xbox Games Make Top 20\n 15\nFeature I've Never Played Final Fantasy 7 Before, But I'm Liking The Remake On Xbox So Far\n 8\nNews Xbox Updates 'Safer Gaming' Principles In Partnership With Nintendo & PlayStation\nGuide Xbox Game Pass: All Games Coming Soon In January 2026\nNews Xbox Gives Refunds For Red Dead Redemption Following Recent Upgrade Issues\nFeature Eight Free-To-Play Games To Look Forward To On Xbox In 2026\nNews Star Wars Genesis Creator Explains Why Viral Starfield Mod Is 'Never' Co...\nNews Five Xbox Game Pass Titles Get New Reveals At The New Game Plus Showcase...\nNews New Xbox Hardware Is Reportedly Set To Arrive In 2026\nNews New Guitar Hero-Style Game Announced For Xbox Alongside 'Telecaster Edit...\nFeature These 20+ Games Are Coming To Xbox Next Week (January 12-16)\nGuide Microsoft Rewards & Xbox: How To Make 10,000 Points Per-Month (2026 Edit...\nNews Xbox's Avowed Gets Permanent Price Drop To Coincide With Upcoming PS5 Re...\nPopular Right Now\nShow More \nJoin 135,489 people following Pure Xbox:\n© 2026 Hookshot Media, partner of IGN Entertainment | Hosted by 44 Bytes |  AdChoices | Do Not Sell My Personal Information"
    },
    {
        "source": {
            "id": null,
            "name": "Nintendo.com"
        },
        "author": null,
        "title": "Rediscover your playful past with the Nintendo Switch 2025 Year in Review - nintendo.com",
        "description": "Take a scroll down memory lane and see your gameplay stats for the Nintendo Switch and Nintendo Switch 2 systems.",
        "url": "https://www.nintendo.com/us/whatsnew/rediscover-your-playful-past-with-the-nintendo-switch-2025-year-in-review/",
        "urlToImage": "https://assets.nintendo.com/image/upload/v1643742733/ncom/global/social-share.jpg",
        "publishedAt": "2026-01-13T19:34:06Z",
        "content": "01/13/26 Learn more Rediscover your playful past with the Nintendo Switch 2025 Year in Review\n\nTake a scroll down memory lane with your personalized Nintendo Switch™ 2025 Year in Review!\n\nExplore the games you’ve played on the Nintendo Switch and Nintendo Switch 2 systems this past year, along with a closer look at how you played.\n\nOnce you’ve checked out all your stats, you can choose your favorite game of the year. And don’t forget to share your gaming story with others and see what they’ve been playing via the official #NintendoSwitch2025 hashtag on social media.\n\nPlus…well, why stop at 2025? Explore your entire history with Nintendo Switch, going all the way back to the day you began playing.\n\nWe hope you enjoy the lookback as you look forward to even more fun in the future!\n\nCheck out the Nintendo Switch 2025 Year in Review website to get started."
    },
    {
        "source": {
            "id": null,
            "name": "9to5google.com"
        },
        "author": "Will Sattelberg",
        "title": "The Galaxy Z Fold 8 might be Samsung’s first foldable to ship without a crease - 9to5Google",
        "description": "As long as Samsung can stomach the inevitable price hike it'll have to push to customers, the Galaxy Z Fold 8 could arrive creaseless.",
        "url": "http://9to5google.com/2026/01/13/samsung-galaxy-z-fold-8-creaseless-rumors/",
        "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2025/07/galaxy-z-fold-7-53.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
        "publishedAt": "2026-01-13T19:23:00Z",
        "content": "Foldables have come a long way since the days of 2019’s original Galaxy Fold. We’ve seen successors from both Samsung and its rivals introduce slimmer, more durable designs with larger displays and fewer compromises. That said, one obvious blemish remains running straight down the middle of any given folding screen. If Samsung has its way though, that soon could be a thing of the past.\nAs is usual, Samsung Display showed off a bunch of in-the-works display prototypes at CES 2026 last week, including one foldable panel that lacked any kind of visible crease. Now, following leaked details on how Samsung might look to perfect this display ahead of this year’s crop of foldables — which is heavily rumored to include Apple’s very first entry — it sounds like the Galaxy Z Fold 8 might actually be the first device of its kind to hit store shelves without a visible crease splitting its screen into two.\nAccording to ZDNet Korea, Samsung is leaning on its new technology to deliver a pretty big jump in screen performance to this summer’s Galaxy Z Fold 8. Rather than layering its OLED panel as is typical for this sort of screen, Samsung Display’s new screen includes changes to its optical clear adhesive keeping the panel materials together, which makes the screen less stiff and “reduce[s] wrinkles.” The end result should be a folding panel that effectively looks more like any standard screen shoved behind traditional glass.\nWhile Samsung does appear to be leaning towards including this in the Fold 8, today’s reporting does suggest the company hasn’t completely locked a decision down just yet because of expected price increases. Expect Samsung to lock in its panel decision around the end of Q1, just ahead of production for this year’s foldable. If the Fold 8 does miss out on this new display, it might be a result of already-anticipated price increases coming from ongoing RAM shortages.\nAs for whether this is the technology powering Apple’s allegedly crease-less folding iPhone, ZDNet says otherwise. The outlet specifically quoted an “official” who said anything headed to the iPhone wouldn’t be able to be shown off in such a public capacity.\nFTC: We use income earning auto affiliate links. More.\nCheck out 9to5Google on YouTube for more news:\nSamsung is a technology conglomerate based out o…\nWill Sattelberg is a writer and podcaster at 9to5Google.\nYou can reach out to Will at will@9to5mac.com, or find him on Twitter @will_sattelberg"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Janhoi McGregor",
        "title": "Samsung Galaxy S26 Ultra Gets Updated Release Date - Forbes",
        "description": "Samsung confirms \"inevitable\" price increases. The real concern is what this means for Samsung's upcoming Galaxy S26 deals.",
        "url": "https://www.forbes.com/sites/jaymcgregor/2026/01/13/samsung-galaxy-s26-ultra-price-increase-deals-risk/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67f940ce7486e3f54d6e2e95/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2026-01-13T19:21:00Z",
        "content": "ByJanhoi McGregor,\nSenior Contributor.\nUpdate January 12th 17:01 ET: We’re still in the dark about Samsung’s official pricing plan, but there is new information on when exactly the Samsung Galaxy S26 series will be available to buy. Dealabs has confirmed previous rumors that this year’s Galaxy Unpacked will take place on February 25th at 7 PM Central European Time, which would be 10 AM PT and 1 PM ET.\nThis is the first time we have an actual time for the event and unveiling. However, what’s more interesting is that Dealabs claims the Galaxy S26 series will go on sale in Europe on March 11th. That is within the 14-to-16-day window between the announcement and the on-sale date that Samsung has typically stuck with in previous launches. What’s different this time is that Samsung usually releases its phones on a Friday, but March 11, 2026, is a Wednesday.\nWhile Dealabs reported that the phone will go on sale in Europe on March 11th, modern-era Samsung Galaxy S flagships usually release globally on the same day. I expect the March 11th date to apply to the U.S. too.\nThe final major question remains the price, with Samsung reportedly still deciding on how much its flagship Galaxy S26 series will cost. Read on for more details about Samsung’s future pricing strategy and how it could affect the company’s aggressive deals and Galaxy S26 Ultra trade-in plans.\nOriginal story below…\nAfter weeks of reporting from Korean media that Samsung was weighing a price increase for the Galaxy S26 series, Samsung executives have now openly said a price hike is a distinct possibility. That is, of course, bad news for consumers, but the bigger casualty will be Samsung’s hyper-aggressive deals—especially those involving the Galaxy S26 Ultra.\nIn case you missed it, memory prices have skyrocketed because of the AI boom, with factory space, RAM, and flash storage being diverted to powering AI data centers. That means higher costs to make a smartphone and, likely, a higher retail price.\nSpeaking to Reuters at CES 2026, Samsung Electronics co-CEO TM Roh said that \"no company is immune\" to the pressure of the global memory shortage and subsequent skyrocketing prices, including Samsung’s smartphone business. Roh didn’t rule out raising product prices, going as far as to say that it was “inevitable.”\nDon’t miss out on Galaxy S26 Ultra price news and future deals by signing up to my newsletter here. \nET News published a story claiming that Samsung is still weighing a price hike of between 44,000 won ($31) and 88,000 won ($62) per model. In the U.S., that could mean the Galaxy S26 series could top out at roughly $859, $1,059, and $1,359 for the base, Plus, and Galaxy S26 Ultra models, respectively.\nBut the real casualty could be Samsung’s promotions that knock hundreds off the phone. ET News also claimed that Samsung is considering axing its signature double-storage deal (e.g., from 256GB to 512GB) it typically launches during the pre-order period. That could be a bad omen for the future.\nDuring Black Friday, the Korean company slashed the Galaxy S25 Ultra 512GB down to $859.99. That included a straight $400 off if no phone was traded in, or enhanced trade-in prices if one was. \nA sub-$900 Samsung flagship, with the second-highest memory option, is about as good as it gets. For reference, six weeks before the Galaxy S26 lands, Samsung has only discounted the Galaxy S25 Ultra 512GB down to $1,119.99.\nA sub-$900 Galaxy S26 Ultra 512GB may simply not be possible for the Korean company this Black Friday, or any other time it runs a deal (which it does a lot). Agressive deals a huge part of Samsung’s marketing strategy; whether it is free software subscriptions, incessant discount codes, or giving away a free Galaxy S25 with select TV purchases, it’s not clear if the Korean company will be able to continue.\nMaybe the company pivots to different types of deals that don’t eat as far into profit margins, like giving away free tablets, watches, and laptops. The problem is that Samsung’s other gadgets are similarly affected by the memory price surge.\nIf memory prices continue to stay high because demand can’t meet supply (generative AI, and the resources it is vacuuming up, isn’t going away), then I can see Samsung leaning further into free software giveaways. \nWe’ve already seen Galaxy phone and tablet buyers repeatedly gifted a free 12-month subscription to Perplexity Pro. In previous years, Samsung has bundled a year of Disney Plus for select Galaxy users, or subscriptions to Adobe Lightroom, SiriusXM, and Peacock Premium.\nAnother option is raising the cost of other Samsung devices to subsidize the Galaxy S line. A report from Maeil Business said that the company is considering raising Galaxy A-series prices to keep the Galaxy S26’s price competitive.\nUpdate January 13th 14:21 ET: The Galaxy S26 Plus will replace the Galaxy S26 Edge this year, which has been cancelled, The Elec confirms (again). The Korean publication reported that Samsung has made the decision to shelve the ultra-slim phone, which was due to land with the rest of the Galaxy S26 series next month.\nThis decision was made in October after seeing how poorly the Galaxy S25 Edge and iPhone 17 Air sold (and were received), giving Samsung a shorter-than-normal amount of time to create and manufacture its replacement. The Elec claims that Samsung will complete manufacturing for the Galaxy S26 Plus and base Galaxy S26 this month. The Galaxy S26 Ultra went into production earlier in December.\nIn terms of specifications, the Galaxy S26 Plus will feature a 6.66-inch screen, which is just slightly shorter than the 6.7-inch display of the Galaxy S25 Plus. Samsung had apparently considered using the same OLED panel developed for the cancelled Galaxy S26 Edge but opted for a similar display to the one used in the Galaxy S25 Plus.\nBecause of the last-minute decision to bring back the Galaxy S26 Plus, The Elec claims that some parts of the Galaxy S25 Plus are expected to be reused in the S26 Plus. The base Galaxy S26 display will also receive a small size boost, growing from the Galaxy S25’s 6.2-inch screen to 6.27 inches. "
    },
    {
        "source": {
            "id": null,
            "name": "Videocardz.com"
        },
        "author": null,
        "title": "NVIDIA quietly delays stable NVIDIA App release for DLSS 4.5 - VideoCardz.com",
        "description": null,
        "url": "https://videocardz.com/newz/nvidia-quietly-delays-stable-nvidia-app-release-for-dlss-4-5",
        "urlToImage": null,
        "publishedAt": "2026-01-13T19:04:50Z",
        "content": "This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data.\nYou can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page.\n\nCloudflare Ray ID: 9be5b96fdc7e9e6f\n•\n\n        Your IP:\n        Click to reveal\n2a01:e0a:23c:1ca0:6944:a750:4b7:15a4\n•\n\nPerformance & security by Cloudflare\n"
    },
    {
        "source": {
            "id": null,
            "name": "Digitalfoundry.net"
        },
        "author": null,
        "title": "Why Intel's Panther Lake Won Digital Foundry's CES 2026 - Digital Foundry",
        "description": null,
        "url": "https://www.digitalfoundry.net/news/2026/01/why-intels-panther-lake-won-digital-foundrys-ces-2026",
        "urlToImage": null,
        "publishedAt": "2026-01-13T18:59:00Z",
        "content": "\nGuest\nLogin | Sign Up\nDigital Foundry\n\nGuest\nUser\nFeature\nImpressive results against competing mobile GPUs and even desktop graphics.\nSubscribe to Digital Foundry on YouTube1.5m\nOn a device and hardware basis, especially on the PC gaming side, CES 2026 left us a bit cold. Nvidia didn't reveal any new consumer-grade GPUs this year, while AMD only had one gamer-centric CPU announcement - an incremental bump to the Ryzen 7 9850X3D. The show's pole position, then, went to Intel - and handily. Though Intel's focus at CES 2026 was the mobile-minded Panther Lake platform, portable and handheld PCs are arguably the future of mainstream devices - and Intel fearlessly let us put their new processors through a Digital Foundry-calibre barrage of testing. The results eclipse all expectations we brought with us to CES 2026 about integrated graphics.\nPanther Lake is a chip package that comes in many configurations. Most Core Ultra 3 processors include 16 total CPU cores, divided between four performance cores, eight efficiency cores and four low-power efficiency cores. The exceptions are two lower-spec processors with eight total CPU cores. And all feature an NPU with around 50 TOPs.\nThe Panther Lake processors that include B390 GPUs - the Ultra X9 and Ultra X7 - include 12 Xe graphics cores and are advertised as comparable to a mobile Nvidia RTX 4050 in terms of graphics performance. The remaining processors come with an integrated \"Intel Graphics\" option with four Xe graphics cores. The number of PCIe lanes also varies. Panther Lake processors that are intended to be used with integrated graphics, including the top-end 12 Xe core variant, get the small platform controller tile with 12 PCIe lanes, while desktop replacement variants meant to be paired with discrete graphics get the large platform controller tile, which packs 20 lanes.\nThe Panther Lake compute tile, which contains the CPU cores, is built on Intel's new 2nm-class 18A process. This is one of the first products to ship on the new process, if not the first. The other tiles use a mix of processes: Intel 3 and TSMC N3E for different variants of the graphics tile, TSMC N6 for the platform controller tile, and an unknown process for the base tile that supports them.\nLooking at the CPU release list, there are different sizes of compute tiles, GPUs and platform controller dies that differentiate Panther Lake U, Panther Lake H and - what we're focused on today - the next-generation mobile platform that is Panther Lake H 12 Xe.\nAt the second of two Intel-hosted events at CES 2026, Digital Foundry was given free reign to test a \"reference design\" laptop from Lenovo, with an apparently maxed-out iGPU along with 32GB of DDR5 RAM clocked at 9,600 MT/s. Intel asked our CES panel to withhold CPU-specific testing until we receive final, retail Panther Lake hardware at a later date. GPU-intensive testing, on the other hand, was fair game.\nCyberpunk 2077 made sense as a GPU-pounding test - one that we're surprised Intel let us push on an iGPU of all things - so we ran CP77's built-in benchmark sequence at the ultra graphics preset with RT reflections and sun shadows enabled.\nThe same tests as run on AMD Strix Point and AMD Strix Halo devices, all running at a 65W power maximum (probably aligned with the Panther Lake reference platform) show a generally repeatable result. Intel's latest doubles performance of our top-end Strix Point APU, while the Strix Halo part exceeded Panther Lake by 21-24 percent. These performance gulfs were similar whether running the benchmark at native 1080p, with equivalent \"2x2\" upscaling - XeSS Balanced and FSR 3 Performance - or with upscaling combined with 2x frame-generation. Technically, the Strix Halo numbers in the latter test are capped by a 120fps v-sync on Strix Halo and could thus possibly enjoy a higher frame-rate gap compared to Panther Lake.\nStill, we're left with Panther Lake turning in something close to a 30fps line for CP77 without any upscaling while rendering at a desktop-class preset - complete with RT that's arguably a cherry-on-top visual flourish, not a visual-character requirement of the game. Add decent-looking upscaling, and that result hovers close to a 60fps line. Go further and add XeSS's 2x frame-generation to exceed 90fps while looking quite good. All thanks to an integrated GPU!\nWe're less convinced that results from 3x and 4x frame-generation systems make sense for portable-minded displays, which typically max out at roughly 120Hz, but that support is there and could support interesting future-proofed frame-rate options down the line for Intel-powered handheld PCs. Additionally, in the handheld market, XeSS as an upscaler while running on dedicated Intel silicon offers superior image quality to either XeSS's AMD-compatible DP4A model or AMD's own FSR - a significant perk for anyone buying a new handheld PC.\nOur next test revolved around Doom: The Dark Ages' ultra preset at 1080p resolution without any upscaling - which, as we've covered, requires RT functionality to operate. The results of our \"Siege\" benchmark tests are similar to our CP77 findings. The Panther Lake laptop doubled Strix Point's frame-rate, reaching a 33.33fps average, while the Strix Halo performance was 30 percent higher than Panther Lake.\nOur final benchmark run, Shadow of the Tomb Raider, was also run at 1080p resolution with RT shadows set to \"ultra\" and other settings set to \"highest.\" Performance varied between its three segments enough to raise our eyebrows at some Panther Lake performance dips, but we once again found a similar performance divide in its most gameplay-like middle segment, where Panther Lake doubled Strix Point on an average fps basis, while Strix Halo ran 32.4 percent faster than Panther Lake.\nAfter finishing these comparisons of mobile-minded APUs, we went back to run the same three games' 1080p benchmarks - at the same RT-enabled, \"ultra\" presets - on two entry-level desktop GPUs: the AMD RX 6600, which can be found for under $200, and the Nvidia RTX 3050, which isn't necessarily as affordable but is the lowest-end RTX GPU currently available for purchase.\nCompared to Panther Lake, each desktop GPU ran no more than 14 percent faster than Intel's B390 iGPU, with the exception of the RTX 3050 enjoying a notable 27 percent lead over Panther Lake when each respective GPU's native upscaling solution was enabled. There's also the matter of some of Shadow of the Tomb Raider's individual benchmark segments somewhat hobbling Panther Lake compared to the competition, but again, its middle benchmark sequence (closest to actual gameplay) was only bested by our AMD and Nvidia entry-level GPU choices by as much as 12 percent.\nBeyond the frame-rate and frame-time graphs, we also must note that XeSS frame-generation at a 4x multiplier has looked quite impressive, enough so that on-site with Intel's reference laptop, we couldn't tell via artefacts or other visual tells how many frames are being generated. And as we noted, XeSS on native Intel GPUs is superior on an image quality basis compared to options that are compatible with Strix Halo - which arguably means you'll get better image quality on a Panther Lake device than a Strix Halo one, even if we consider the performance lead Strix Halo has enjoyed in today's benchmarks.\nWe're left wondering if or when AMD will ship SoCs that support the newer FSR 4 upscaling standard, or otherwise refresh its SoC line to advance at the same rate that we're seeing from Intel - and CES 2026 was far from exciting from AMD on a hardware-reveal level. The firm announced Gorgon Point, which is effectively a re-spun and refined Strix Point. It'll be better than the results seen here, but not to any dramatic degree. We get the idea that proper next-gen APUs from AMD may well jump ahead to RDNA 5 - we'll just have to see.\nThus, we're left impressed with Intel's showing. Still, what we've tested thus far doesn't directly answer how well Panther Lake iGPUs scale to power limits in the 30W range - a much better fit for handhelds. And more glaring is the lack of pricing information at this point: might we see prices comparable to Strix Halo devices, thus revising our impressions altogether? Or can Intel find the sweet pricing spot to land a competitive blow? We hope to get more hands-on time with the Panther Lake line-up soon.\n About Sam Machkovech\n\nSam Machkovech has been writing about the intersection of art and technology since 1996, and his career began with a nationally syndicated game-review column while still in high school. He has since written for American Airlines, Ars Technica, The Atlantic, Billboard, Edge UK, Game Developer, The New York Times, Polygon, The Stranger, and more. He is based in Seattle, and his favorite video game, by a longshot, is Picross 3D Round 2.\n Comments 2\n\nThese new chips and RAM prices the way they are gonna push prices beyond what might be reasonable for a handheld...prices already are nuts for existing devices!\n\nIn the video it shows that the reference laptops run at 65 watts, with Intel saying the TDP on those chips is 80 w it will be interesting to see how a full power version scales and sits against Strix Halo on 80 w as well. I wonder if the reference laptops were set at 65 w because it is the sweet point for performance or just because it fits into a chassis and cooling for the reference design.\n Show Comments\n Leave A Comment\nHold on there, you need to login to post a comment...\n\nIntel Panther Lake: Mobile Graphics, Entry-Level Desktop Performance\n2026 looks set to deliver a laptop/handheld battle royale.\n\nIntel: Stutters in PC Games are \"Breaking Immersion\"\nTom Petersen on the present - and the future - of PC performance at CES 2026.\n\nWhy Intel's Panther Lake Won Digital Foundry's CES 2026\nImpressive results against competing mobile GPUs and even desktop graphics.\n\nNvidia Hands-On at CES: DLSS 4.5, Path-Traced Pragmata\nDynamic Frame Generation, RTX Remix Logic, more.\n\nNvidia Announces DLSS 4.5 - New Transformer Model Already Live\nAmbitious \"Dynamic Frame Generation\" coming \"Spring 2026.\"\n 2\nFeature Why Intel's Panther Lake Won Digital Foundry's CES 2026\n 1\nNews CES 2026 In Review: Short on Gaming Hardware, Big on TVs and Monitors\n 6\nFeature Nvidia G-Sync Pulsar is a Motion Clarity Revelation\n 8\nFeature Intel Panther Lake: Mobile Graphics, Entry-Level Desktop Performance\n 3\nNews Intel: Stutters in PC Games are \"Breaking Immersion\"\nFeature Nvidia G-Sync Pulsar is a Motion Clarity Revelation\nFeature Intel Panther Lake: Mobile Graphics, Entry-Level Desktop Performance\nNews Intel: Stutters in PC Games are \"Breaking Immersion\"\nFeature Why Intel's Panther Lake Won Digital Foundry's CES 2026\nNews Nvidia Hands-On at CES: DLSS 4.5, Path-Traced Pragmata\nNews Nvidia Announces DLSS 4.5 - New Transformer Model Already Live\nNews CES 2026 In Review: Short on Gaming Hardware, Big on TVs and Monitors\nFeature 1998's Unreal: Past, Present And A Path-Traced Future\nFeature GPD Win 5 Brings PS5-Class Perf To PC Handhelds\nNews AMD Unveils Ryzen 7 9850X3D: Fast, Incremental\nPopular Right Now\nShow More \nJoin 1,708,488 people following Digital Foundry:\n© 2026 Digital Foundry, in partnership with Hookshot Media | Hosted by 44 Bytes"
    },
    {
        "source": {
            "id": null,
            "name": "GamesIndustry.biz"
        },
        "author": "Vikki Blake",
        "title": "Shift Up CEO claims AI is essential for smaller nations competing with the manpower of China and the US - GamesIndustry.biz",
        "description": "The CEO of Shift Up, the studio behind Stellar Blade and Goddess of Victory: Nikke, believes countries like South Korea…",
        "url": "https://www.gamesindustry.biz/shift-up-ceo-claims-ai-is-essential-for-smaller-nations-competing-with-the-developmental-manpower-of-china-and-the-us",
        "urlToImage": "https://assetsio.gnwcdn.com/ss_2d4ad1a81618920416e7b68d02dc266ac898f144.1920x1080.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
        "publishedAt": "2026-01-13T18:55:26Z",
        "content": "\"We devote around 150 people to a game, China puts in between 1,000 to 2,000\"\nThe CEO of Shift Up, the studio behind Stellar Blade and Goddess of Victory: Nikke, believes countries like South Korea have no choice but to adopt AI technology if they wish to remain competitive with larger nations such as China and the US.\nAddressing delegates at South Korea's 2026 Economic Growth Strategy event, Hyung-tae Kim said that while a studio like Shift Up doesn't have the staff to rival that of Chinese competitors, AI can help maximize headcount as well as safeguard jobs, as developers could become more valuable if they're trained in AI tech.\n\"We devote around 150 people to a single game, but China puts in between 1,000 to 2,000,\" Kim said, as reported by GameMeca, and picked up by Automaton (via machine translation).\nWhile a hugely divisive topic, Kim believes that because countries like South Korea \"lack the capacity to compete, both in terms of quality and volume of content,\" making the most of generative AI could see one trained developer \"perform the work of 100 people.\"\nIn related news, Belgian games developer Larian Studios recently confirmed that there will be no generative AI used for concept art during the creation of the upcoming RPG Divinity. The assurances came after CEO and co-founder Swen Vincke sparked a backlash when he said the company had tried to incorporate AI into the creation of Divinity.\nThe studio CEO later clarified that it was not replacing concept artists with AI, adding that the company had used the technology \"to explore things\".\n© 2026 GamesIndustry.biz, an IGN Entertainment Inc. brand. 18 Mansell Street Level 3, London, E1 8AA, United Kingdom. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. GAMESINDUSTRY.BIZ is a registered trademark of Gamer Network Limited, an affiliate of IGN Entertainment Inc."
    },
    {
        "source": {
            "id": "the-verge",
            "name": "The Verge"
        },
        "author": "Sean Hollister",
        "title": "Lego Smart Brick: watch an immersive 15-minute demo like you’re right there with us at CES - The Verge",
        "description": "The Verge filmed VR180 video of the Lego Smart Brick demo at CES 2026, letting you see what it was like to be in the room.",
        "url": "https://www.theverge.com/tech/861322/lego-smart-brick-vr-180-3d-video-demo-ces-2026",
        "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/01/lego-smart-bricks-demo.jpg?quality=90&strip=all&crop=0%2C3.4554973821989%2C100%2C93.089005235602&w=1200",
        "publishedAt": "2026-01-13T18:48:01Z",
        "content": "is a senior editor and founding member of The Verge who covers gadgets, games, and toys. He spent 15 years editing the likes of CNET, Gizmodo, and Engadget.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nCES 2026 live: all the news, announcements, and innovations from the show floor and beyond\n\nThe Lego Smart Brick won our Best in Show award at CES 2026, and it was no wonder after watching Lego designer Maarten Simons’ expert demo there. So I thought: why not let you virtually attend the same tech demo I did? Before I left Las Vegas, I snuck back into Lego’s suite to film a 15-minute uncut immersive video of what these bricks can do.\n\nIt just so happens I brought an unusual camera to Las Vegas this year: a Qoocam Q3 Ultra modded for VR180 capture by Siyang Qi. It creates spatial stereoscopic 3D video that you can experience in a headset (like the Meta Quest), or tap-to-drag on a flat screen, or even tilt using the sensors in your phone.\n\nTo watch it on a Quest headset, you’ll want to tap this video here on the website or click this YouTube link while logged into your Google account. Then, open the YouTube VR app in your headset, tap your profile pic at the upper right, and select the History tab. It should be the newest video there.\n\nFor best results, tap the gear icon, and set video resolution as high as it will go (likely 2160s). We recorded and uploaded in 8K, not just 4K, but for some reason YouTube isn’t showing us full resolution yet. Fingers crossed it’ll appear later!\n\nIf this video stops working for whatever reason, you can find my original Lego Smart Brick hands-on video at YouTube, Instagram, or TikTok, and embedded below.\n\nIs VR180 something subscribers would like to see more of? Let us know, but no promises — the video workflow isn’t as easy as I’d hoped!"
    },
    {
        "source": {
            "id": null,
            "name": "Insider-gaming.com"
        },
        "author": "Grant Taylor-Hill",
        "title": "Tarkov Lead Teases New Sci-Fi Apocalypse Game That Has Everyone Confused - Insider Gaming",
        "description": "Nikita Buyanov, the head of the studio at Battlestate Games, has teased a new game called CORIE (or COR3) that has everyone perplexed.",
        "url": "https://insider-gaming.com/tarkov-lead-teases-new-sci-fi-apocalypse-confused/",
        "urlToImage": "https://insider-gaming.com/wp-content/uploads/2026/01/Screenshot-2026-01-13-181110-1024x503.png",
        "publishedAt": "2026-01-13T18:45:18Z",
        "content": "Escape from Tarkov fans have been left bewildered by the latest string of social media posts from Nikita Buyanov, the head of the studio at Battlestate Games. He recently unveiled a social profile created in 2024 linked to a website for a fictional entity named ‘CORE Corp’, and heading to that website uncovers a wealth of information.\nAt first blush, it appears to be an entirely new game, rooted in a sci-fi, interplanetary universe where Earth has been left partially destroyed by some unseen cataclysm and rendered radioactive. There are daily challenges to resolve, modules to unlock, AI characters to talk to, and stacks of mysteries to unravel.\nCOR3.gg is the webpage that Escape from Tarkov lead, Nikita Buyanov, linked his followers to earlier today. It’s mocked up to look like a retro-futuristic computer interface, like something you’d find in Fallout or ARC Raiders.\npic.twitter.com/N6OCR1KvZ9\n\nOnce you’ve completed the very basic login puzzle (by entering your email and getting an OTP), you’ll be given a unique identifier that you’ll need to hold on to. This will get you into the system if you happen to log out inadvertently.\nThe ‘CORIE’ operating system you’re exposed to will now present you with a string of options. You can check messages, interact with a virtual (but locked-down) browser, see that the weather is apocalyptic, and listen to a gravelly radio. There’s a notepad, an updater module, and a series of daily challenges that involve probing strings of files and attempting to figure out what the errors in them are.\n\nCORIE appears to be set in 2251, or thereabouts. There are ‘logs’ from the player character that serve as a little backstory to CORIE, or COR3, whatever it’s called:\nToday is my first day as a private investigator for “History Unfolded”.\nThe contract has been signed and all the terms agreed for. But I am still shocked about how smooth that went. Those people … the “handler” – they didn’t even ask that many questions. It seemed like they knew me for quite some time. And that Aurana chick … stunning but dangerous. She gives me chills.\nHow did I even get here … have been asking that myself for several days now. Guess wanting something new and mysterious can sometimes lead to such adventures.\nThe main goal of that “contract” is to uncover some old mysteries it seems. But I wonder if those are truly a secret for the people who hired me, because they seem to be very well informed. Like having deep knowledge on most events.\nMaybe they are looking for an alternative opinion, or maybe they found something interesting in my personality and skill set … Honestly, I am not sure I would even like to know.\nAn on-site ’employment contract’ reveals that you’ve been hired by Aurana Strogova, and that you’re tasked with ‘uncovering the files related to experiments that took place on -redacted- from 2170 to present time.’\nThe entire thing is quite bizarre.\nThe top screen for CORIE looks to be set in some kind of underground bunker. You can interact with the environment, studying various items that are described from a first-person perspective. There’s a junk box full of scrap, a ventilation system, and various pieces of armor, including a mining helmet.\nOne of the item descriptions reads:\nDarkhound ‘Oppressor’ Modular Plate Carrier\nA universal plate carrier from a legendary company known throughout the solar system. I’ve taken it everywhere, wherever it’s weapon-based environment.\nIt smacks of ARC Raiders crossed with Fallout, as I mentioned before, but it’s interplanetary. There’s talk of space elevators, cargo ships adrift in the great beyond around nearby planets like Venus, and talk of immense death-ray-sounding weapons built to intimidate and deter space pirates.\n\nThere’s a full-fledged space council, a navy equipped with battle cruisers, and the back stories of several characters are explored at length.\nIn one section, a faction called Alternative Future can be uncovered, but it’s said that to find out more information, you’ll need to ‘visit any one of (their) outposts.’\nThis is all very confusing, and fans of Escape from Tarkov and Battlestate Games have been left bewildered. While more information is dug up, it’s worth heading over to COR3.gg and seeing what you can uncover.\nAre you as confused as everyone else about Nikita Buyanov’s new game? Let us know what you’re thinking on the Insider Gaming Discord server.\nFor more Insider Gaming coverage, check out the news that Meta has closed multiple studios\n\n                    Grant's passion for gaming started on the Amstrad CPC when he wasn't even old enough to walk properly. Now, he's a multi-platform expert gamer with an undying love for the…                  \nKeep it civil. Your email won’t be published.\nComment\nName *\nEmail *\n Save my name, email, and website in this browser for the next time I comment.\n\nΔ\nMarvel Rivals Deadpool can play as 3 different roles: Duelist, Vanguard, and Strategist. Here are more details. \nDeveloper 34BigThings has released a brand new gameplay trailer for Carmageddon: Rogue Shift, releasing on February 6.\nMeta is laying off at least 10% of its Reality Labs division, which includes multiple game studios, some of which are being shut down.\nLarry ‘Major Nelson’ Hryb has been laid off from Unity less than two years after joining the company, he has revealed."
    }
]